[
  {
    "cluster_id": 0,
    "question": "Asalomu aleykum hammaga menda HttpResponse ishlamayapti nimadan bo'lishi mumkin?",
    "variants": [
      "Assalomu alaykum yaxshimisizlar kursdoshlar. Bitta savol bor edi. Faollar jadvalidagi kubiklarni qanday qilib kópaytirsam boʻladi?",
      "Assalomu alaykum, python bo'limini tugatib vazifa yuklagan edim, vazifa tekshirilishini kuting degan yozuv bor, SQL ni ko'rishga dostup yo'q, qachon dostup ochiladi? Javob uchun rahmat",
      "Hammaga salom! Resumeni Education joyini qandoq toldiradi yordam bervorila",
      "Ha qancha ko'p darslik bo'lsa shuncha yaxshi bo'lar edi. Hech qanaqa freymvorklarsiz Sayt tuzish oladigan darajada erishishimiz kerak....!hozir fretwork bilan zurg'a turadigan darajadamiz....😁",
      "Hammaga Salom! Manda bitta savol bor. Full Stack Pythonni bitirganimdan kegin ishka kirvotkanimda, qanaqa education sand bor desa nima disam boladi?",
      "Assalomu aleykum js dagi darslar o'zgardimi ulugbek samigjonovga",
      "Assalomu aleykum, men bugun css ni boshladim vscodega live server ni o'rnatdim shuni ochsam yandeksdan ocyabdi manga chrome ochilishi kerak edi",
      "runserver qilsam shunaqa xato beryapti. Deploy qismi.",
      "swaggerni drf-yasg qilib o'rnatdim. runserver qilsam xato beryapti.",
      "Assalamu alaykum. Manda bir savol bor. Registratisyadan o'tgan har bir user uchun bazada alohida sxema ochilishi kerak buni qanday qilsam bo'ladi?",
      "sms jonatish ximatini qanday ulansa boladi Eskiz, Twilio kabilar dan foydalanmasdan. ozimizni Sim kartadan sms jonatish...",
      "Assalomu aleykum menda shunde chiqib qolyabdi sababi nimadan?",
      "Assalomu alaykum men uyga vazifani jo'natishim kerak edi, github link ni joyladim lekin faylni yuklab bo'lmayapti \"Validatsiya xatosi\" deyapti. Iltimos shunga yordam beringlar, biladiganlar bormi",
      "Assalomu Aleykum FulStackPython kursi bo'yicha oxirgi loyihani saytga yuborgandim, shuni iltimos tekshirib bersangiz",
      "Assalomu alaykum, men HTML dan 1-uyga vazifani bajarub yuborib qo'yqandim shuni tekshirib bering iltimos",
      ", , , Биринчи топширикни бажардим лекин юклаб булмаяпти.",
      "Salom. Nima uchun admin paneldan film qoshsam qo'shilmayapti. lekin hech qanday muamo yo'q ID ham joyida lekin qo'shilmayapti nima uchun kimdir avval ham bu xatoga duch kelganmi?",
      "Assalomu aleykum blocktrans ni ichidagi hamma fayllarni bitta faylga locale ga joylashtirishda xato beryapti yangi versiyani tashash kk debmi nima ln yangiroq versiyani tashadim iltimos shunga yordam beringlar",
      "django-hitcount ni ornatgandan keyin nimaga shunaqa xatolik beryapti",
      "vazifani topshirdim tekshirib berasizmi",
      "bu ngnix dan bolishi mumkinmi",
      "Ustoz darslikda google ilova qoʻshilgan menda unday ilova yoʻq misol tariqasida men oʻzim shunga oʻxshash ilova qilib ketsam boʻladimi",
      "news_detail page da o'chirish tahrirlash togri qosha olmayapman yordam berib yubirlar. get_absolute_url bilan ham slug bilan ha qoshib bolmayabdi",
      "Linkedin degan joyga darslikda deb yozilgan lekin darslikda shu joy nima qiladi qayerdan olinadi deb aytilmagan shu nima vazifani bajaradi va qayerdan olishimni oʻrayap mana kechdan beri",
      "Ha men nima qilay shunday Linkedin yoʻq ku",
      "Oddiy oʻzim uchun oʻrganishga qoʻyib ketsam boʻladimi",
      "Meni nima qilishim kerak shu Linkedin boʻlmasa menda",
      "Assalomu alaykum! Html kursini loyihasni jònatib bòlmayapti. Shunga qanday qilib jònatsam bòladi?",
      "Linkedin degan joyga darslikda deb yozilgan lekin darslikda shu joy nima qiladi qayerdan olinadi deb aytilmagan shu nima vazifani bajaradi va qayerdan olishimni oʻrayap mana kechdan beri",
      ". Assalomu alaykum Python da PEP 8 nima va u qanday vazifani bajaradi. Iltimos soddaroq misol bilan tushuntirib yuborsangiz.",
      "Assalomu alaykum! Html kursini loyihasni jònatib bòlmayapti. Shunga qanday qilib jònatsam bòladi?",
      "htmlni darslari oxirda regsitratsiya qiladigan sahifa yaratishni eilgan ekan uni bajarib yukliman disam xatolik bervotdi.",
      "nima qilsam bo'ladi",
      ", , Assalomu alaykum, FastAPI loyihani frontendga qanday ulasa bóladi shu boʻyicha maʼlumot bervorsalariz",
      "yuklamoqchi bo'lvoman lekin yuklab bo'mayabdi.",
      "Ассалому алейкум. CSS курси бўйича дарсларни текст форматда каердан олсам булади. Курс видеоси остига кавол колдирган эдим, Дарслар булимидан дейишди. Аммо дарслар бўлимини топа олмаяпман. Имкон булса шуни ссылкасини берсалариз",
      "auth dan o'tkazmoqchi bolsam hato beryapti",
      "Assalomu alaykum. Gettextni har qanaqasiga o'rnatib ko'rdim, OSgayam o'rnatib ko'rdim, pypidan packageni ham o'rnatib ko'rdim. Kompyuterni o'chirib yoqib ham ishlatib kordim. Youtubedanam chatgptdan ham qidirib ko'rdim baribir javob topolmayapman",
      "Assalomu alaykum Men FastAPI yordamida online óquv markaz qilmoqchi edim, bu bóyicha qaysi manbalardan yordam olsam bóladi, Youtubedan qidirib topolmadim(yoki qidirishni bilmadim)",
      "FastAPI da login qismini yozayotganimda shunaqa xatolik chiqyapti",
      "Assalomu alaykum hammaga, bir taskda user image kiritadida u kiritilgan image ni fastapi minio serverga yuklashi kerak, shu jarayonda userni image ini qanday qilib json ko'rinishida jo'natish mumkin?",
      "Nega umumiy chat yopilib qoldi",
      "assalomu alekum. openbudget bot qilib ko'rganmisz? yoki bu haqida bilaszmi? bir ikki narsalarni so'ramoqchi edim.",
      "assalomu alekum ustoz yaxshimisz? ci/cd qilayotgan edim. deploy qismi uchun biror foydali article bormi? server bor password bilan shu qanday qilinishi kk?",
      "djangoni pycharmda emas vscode da qilsa boladi nima farqi bor boshlagan loyhani qandey vs code da davom etirib ketsa boladi?",
      "asalomu aleykum hammaga home.html da news.image yozsam rasm sahifaga chiqmayapti nimaga unaqa bo'lyapti",
      "Assalomu alaykum funksiyani tekshirish uchun test yozgandim modulni yuklash bn bog'liq muammo borga o'xshayabdi, nima qilsam bo'ladi?",
      "Assalomu alaykum drf libraryni railway.appga deploy qilmoqchi bo'lsam buni imkoni yo'qligini aytyapti nima qilsam bo'ladi",
      "Assalomu alaykum man python asoslari modulida python asoslaridan vazifa jo'natgandim shunga mentor ko'rib baholashi kerak ekan, bir yordam bervormisizmi, qo'limdan keganicha kod yozdim endi",
      "Ichida argumenti yoq bolgan metodga ham test yozsa boladimi",
      "Assalomu Alaykum! admin panelda userni email ma'lumoti ko'rinmayapti, muammo nimada bo'lishi mumkin, (Rest Ramework - Instagram_clone)",
      "Assalomu aleykum pipenvni ornata olmayapman",
      "amount yani to'lovlar bilan ishlaganda masalan total_amount fieldni modelda saqlaganman. model save bo'lganda total_amount o'zgarishi kk. aytaylik bzda servicelar bor, har birini narxi bor. bza oxirida order modelni saqlaganda bzga hamma service larni umumiy narxini total_amountga saqlashi kk. shuni qanday qilsa bo'ladi best practice va clean code orqali? agar bz modelni update qilsak total_amount ham o'zgarishi kk.",
      "nima sababdan bu xatolik chiqishi mumkin ?",
      "shu savolga javob berib yuboring iltimos",
      "Assalomu alaykum, \"AbstractUser\"ni bosib show context actionni bossam no suggestions deyapti. Qo'lda djangodan import qilmoqchi bo'lsam djangoni o'zini topolmayapti, nima qilsam bo'ladi?",
      ": Assalomu alaykum Bir taklifim bor edi keyingi video uchrashuvda biror bir real ishda ishlatiladigan loyiha qilsak. Yani o'z tajribangizdan o'tgan loyihangiz bo'lsa shuni qilsak Modellar qanday qilinadi real loyihalarda Viewlar qanday qilinishi kerak. API'larni qanday qilib chiqarsak to'g'ri bo'ladi real loyiha uchun. Admin qanday qilinadi real loyiha uchun. Funksiyalarni qayerda ishlatish to'g'ri bo'ladi real loyiha uchun. Agar foydalanuvchilar soni ortib ketishi kutulayotgan bo'lsa loyihani qanday ko'rinishda qilishimiz kerak. Umuman olganda Python'da Real loyiha qanday bo'ladi arxitekturasi tuzulishi modellarning bir biri bilan bog'lanishi funksiyalarni birbiriga ulash image optimization serializerdan qanday to'g'ri foydalaniladi. Signallardan qanday va qachon foydalanish kerak Cache'larni qayerda ishlatsak to'g'ri bo'ladi.",
      "Men js'dagi amaliy topshiriqni tashlagan edim hej kim tekshirmayapdi",
      "Assalomu alaykum! Yechimini qanday to'g'irlasam bo'ladi?",
      "raqam saqlayaptiyu lekin, lekin, email saqlamasdan ushbu xatoni yuzimga uryaptida",
      "Ikkinchisi xato ekan qaytib junatib bulmayapdi? Nima qilish kerak",
      "Assalomu alaukum, instagram cloni loyihasida serializer yozyotganimda email_or_phone qismi ishlamayapti qayerda xato qilyapman",
      "manda comment chiqmayabdi, xatolik bermadi",
      "?",
      "Ikkinchi urinishdaham muvaffaqiyatsizlik bo‘lsa nima qilish kerak?",
      "Assalomu alaykum men Full stack python darsini sotib olgan edim boshidagi html va css darslar yutbdagi ocq malumotdan olingan ekanku men ularni oldin ham korgan edim",
      "Ikkinchi urinishdaham muvaffaqiyatsizlik bo‘lsa nima qilish kerak?",
      "tasdiqlash kodni kiritganimda xatolik beryaptida",
      "ushbu muammoni hal qila olmayapman yordam berasizmi?",
      "PostreSQL da SQL Shell dasturi orqali ro'yhatlar bilan ishlayotgandim keyin ustun nomlari shunaqa ko'rinmay har xil belgilar chiqib qolyabdi, buni qanday qilib to'g'rilasa bo'ladi?",
      "Assalomu Alaykum! ma'lumot saqlanyotganda shunaqa xato beryaptida, qanday yechim topsam bo'ladi iltimos yo'nalish bervoringlar!",
      "2 kundan beri shu muammo bilanman, hech qanaqa bir yechim topolmayapman",
      "iltimos bulardan qaysinisdan foydalansam bo'ladi, tarjima qilgani ingliz tilini bilmiman, qaysi py faylga yozay biror kodni",
      "djangoda saytga yandex ads ni ulaganlar bormi? РСЯ ni o'rniga adfox orqali ulash uchun eng to'g'ri yo'l qaysi? saytidagi custom ads larni qanday tayyorlashgan? (adfoxdan olyapti reklamani)",
      "Assalomu alaykum git hubdan biror projectni yuklab olgandan keyin bu pojectni oʻz kompyuterimizda ishga tushirish uchun nima qilish mumkin.masalan Javascript da shunday holatda npm install qilib yuborsa butun loyihadagi ishlatilgan paketlarni yuklab beradi. Pythonda ham shunday qilish mumkinmi",
      "Assalomu alaykum git hubdan biror projectni yuklab olgandan keyin bu pojectni oʻz kompyuterimizda ishga tushirish uchun nima qilish mumkin.masalan Javascript da shunday holatda npm install qilib yuborsa butun loyihadagi ishlatilgan paketlarni yuklab beradi. Pythonda ham shunday qilish mumkinmi",
      "Assalomu alaykum git hubdan biror projectni yuklab olgandan keyin bu pojectni oʻz kompyuterimizda ishga tushirish uchun nima qilish mumkin.masalan Javascript da shunday holatda npm install qilib yuborsa butun loyihadagi ishlatilgan paketlarni yuklab beradi. Pythonda ham shunday qilish mumkinmi.",
      "Assalomu Aleykum kurs bo’yicha HTMl bo’limini tugatib Job Application strukturasi topshirig’ini bajarib html faylini zip lab saytga yuklamoqchi bo’lsam Validatsiya xatosi deb faylni yuklab bo’lmayabdi shunga yordam bera olasizmi. Oldinda rahmat",
      "Nimaga bunaqa deyapti? Uzidan uzi chiqib ketdi profelimdan",
      "CSS ga o'tmoqchi edim buni to'g'irlasa bo'ladimi",
      "assalomu alaykum Bitta muommo bor edi",
      ".zip fayl yuklansa ham Validatsiya xatosini beryapti. Iltimos shu muammoni hal qilib bering",
      "Assalomu alaykum, . Jo'natilggan vazifa \"mentor javobi kutilyapti\" deb chiqaryabdi. Qachon keyingi modul ochiladi?",
      "?",
      "Asalomu aleykum hammaga menda HttpResponse ishlamayapti nimadan bo'lishi mumkin?",
      "Asalomu aleykum hammaga login password i kiritib login bossam yana shu sahifa qaytib ciqyapti nimaga unaqa bo'lyapti?",
      "nmadan unaqa bo'lyapti yordam berib yuborilar",
      "sqlda jadvalga qoshimcha ustun qo'shsa bo'ladimi?",
      "Assalomu alaykum men live serverni o'rnatgandim lekin menga live server google chromeda emas microsoft edgeda ochib beryapti shuni google chromega to'g'irlash yo'lini o'rgatib yuboring",
      "shunday muammo chiqyapti qanday yechim topsa bo'ladi ?",
      "assalomu aleykum, Mukammal bot kursini o’tgan yili xarid qilgandim lekin darsni o’qimagandim, mudati bormi kursni ? xozir kirsam dostup yoq bervotti ? kimdan aniqlashtirsam bo’ladi o’rtola ?",
      "Assalomu alaykum. Men PYTHON darslarini ko'rayotgan edim. So'z uyinida bir narsaga tushunmadim. QAYSI OPERATOR ISTALGAN TUGMANI BOSGANDA KODNI ISHGA TUSHURADI????",
      "?",
      "assalomu alaykum, mani asosiy maqsadim hozirda full stack dasturchi bo'lish. html, css kurslarini tugatdim va Ulug'bek samigjonovni Javascript kurslarini tugatishimga oz qoldi. Savolim shuki, hozir to'g'ridan to'g'ri pythonga o'tib backendni o'qishni boshlaganim mani maqsadimga tezroq yetishtiradimi yoki ozgina frontendni mustahkamlash uchun 5-6 kichkina proekt qilib ko'rganim afzalmi",
      "shu yerda xatolik beryapti ?",
      "Assalomu alaykum shu formadagi full name degan yozuvlarni pastga tushira olmayapman qanday qiladi! Oldindan rahmat !",
      "aynan logout joyi ishlamayabdi",
      "Assalomu alaykum fastapi da ishlayotgandim, data ni ichidan ni olmoqchi edim error qaytardi get() ni o'rniga biror-bir optimalroq variant bor deb o'ylaysizmi? Error:",
      "Ассалому алейкум барчага. Мен хозир курс бўйича Bootstrap бўлимини ўқияпман. Шунга озгина саволим бор эди. Bootstrap да айрим атрибутлар бор. Мисол учун Spinne ёки Progress ва хоказо....ушбу атрибутлар маълум вақтда ишлайди масалан Spinner загрузка пайти ишлайди. Уни фақат загрузка пайти ишлаши ва загрузка якунлангач ўчиши хакидаги командалар қайси бўлимда ўргатилади.",
      "kerak edi django yangi darslaridan. menda muommo bor bu login va logout qismida logout ishlamayabdi kod deyarli bir xil xammasi 405 xatolik beryabdi",
      "bormidi.............................",
      "Assalom aleykum mentorla soat nechidan nechigacha ishlashadi ish vaqti tugagandan keyin yozib bezovta qimi dvotudm javob uchun oldimdan raxmat",
      "asalomu aleykum hammaga mana shu formaga qandey bootstrap orqali stil beradi, html kodda form di ichida form.as_p orqali chiqarilgan, qandey stil berishdi bilmayapman",
      "misol uchun nav elementlari yoqlmayapti",
      "shuni qarovoring",
      "tag bu postni search qilganda tezroq topish imkoni beruvchi so'zlar misol uchun tg da ham post yozganingizda , hashtagidan foydalansiz huddi shunga uxshab saytda ham postlarga beriladigan tag nazarda tutilgan bu yerda. ha qo'shish kerak",
      "uztoz allauth.account packageni o'rnatsam rasmda keltirilgan hato korsatyapti. rasmdagi 1 va 2 dagi box ni deb hato beryapti",
      "migrations qanday tozalayman batafsilroq tushuntiring",
      "hato o'zgarmadi lekin o'chirdim migrationsdagi faylni",
      "oka iltmos agar iloji bosa video uchrashuvlani telegramdan boshqa dasturda o'tqazing videolani sifati va ovozi juda yomon ovoz uzilib uzilb kevoti malumotla juda qiziq lekin tushunib bomayabdi javob uchun oldindan raxmat))",
      "korinchi shunaqa qilib boglash kerakmi",
      "misol uchun nav elementlari yoqlmayapti",
      "iltimos telegram guruhni oldingi variantiga qaytaringlar(html, css, js alohida edi). Menda API da muammo bo'lsa shu guruhdagi ma'lumotlarni o'qib ko'rardim. Umumiy guruhda hamma narsa kasha bo'lib ketdi",
      "loyihani ga deploy qilmoqchi bo'lganimda fail bo'lyapti, qanday deploy qilsam bo'ladi, javob uchun rahmat",
      "bu xatolik yana takrorlanyapti",
      "Assalom alekum heshtegi bilan yozmasez javob berishmidi",
      "external stillashim o'xshamayapti qayerida hato qildim",
      "Ustoz bu loyha tugagandan kegn boshqa loyha bormi yoki oquvchilardan sorizmi nima loyha qilishni agar iloji bosa shu loyhani telegram botnini orgatsez juda zor bolardi aiogram 3 fremworkidan foydalanib Python+Aiogram+django RestAPI or FastAPI lardan mustahkamlash bolardi",
      "Assalomu alaykum psql va pgadmin4 da muammo bo'layotgan edi sudo lsof -i -P -n | grep LISTEN orqali ko'rganimda 5432 portida listen bo'layotgani aytilyapti lekin kirsam chiqmayapti nima qilsam bo'ladi psql deb yozib kirmoqchi bo'lsam terminalda psql: error: connection to server on socket \"/var/run/postgresql/.s.PGSQL.5432\" failed: FATAL: role \"root\" does not exist shu muammo chiqyapti",
      "savol",
      "Asalomu aleykum POST va GET method nima farqi hech shunga tushunishim qiyin bo'lyapti?",
      "Biz kim qaysi topshiriqni bajarayotganini qanday qilib bilamiz. Bitta vazifani bir nechta odam bajarishi mumkinku bu muammo boʻlmaydimi",
      "Assalomu alaykum aka DATABASE yaratgandim parolini qanday olaman ulash uchun?",
      "bunga ham javob berib keting firebase haqida savol yozgandim",
      "tepada so'ragandim👆",
      "Assalomu alaykum, drf da instagram kloni loyihasini boshlagan edim, menda postgresql 10.23 versiyasi ekan, 12 yoki undan yuqori versiyasi versiyasi o'rnatilishi talab qilinib xatolik beryapti, postgresql boshqadan o'rnatsam xatolik bermaydimi? bunda psycopyg2 ham qayta o'rnatilishi kerakmi? javob uchun rahmat",
      "aka django loyihalarni linkini tashab yuborelesizmi bolar qiganini namuna sifatida",
      "Asalomu aleykum hammaga rasm yoqligi uchun shunaqa hatolik chiqarayapti shetga nima yozsa rasm bomasayam oceydigan qilsa bolado yo uni backendga yozish kerakmi?",
      "Oldin ham mavzuga to'xtalgan edim. Qisqacha tushuntirib ketdim yuqorida. Mendagi muammo nimada. Allaqachon ushbu logika bilan qurilgan project bitta User model qilib role berib ketishga kech ancha boshqacha yo'lini eta olasizmi?",
      "assalom alekum",
      "Ha yuborib bo'lmayabdi.",
      "nimaga migrate qilsam bunaqa hato chiqayapti?",
      "shu darsda yozilgan kodlarni qayrdan olsak boladi",
      "tag tanlasamxam None qiymat chiqyapti",
      "iloji bolsa namuna sifatida loyinani linkini tashab yuboring juda kerak bolyapti",
      "Assalom Alaykum bu masalani nima qildizlar?",
      "Ёк бу болимди охиридаги топширик ошанга олдингилар сайтга жойлаган болса ошаларга караб канде болишини корсам яхши боларди",
      "bitta savolim bor edi men chat yozmoqchi edim telegramga oxshagan djangoda , buni iloji bormi yoki yoqmi , va man django-Channels kutubxonasidan foydalanmoqchi edim",
      "Assalomu alaykum men Loyihani tugatib fayl yuksalsh degan joyiga yuklasam shunday diyapti nima qilsam boladi..?",
      "Assalom alekum men full python kursini xarid qilgandim dars mobaynida homework va shunga uxwagan masalalar berilmayapdi. Nega?",
      "korinchi qayerdi ozgartirish kerak",
      "None qiymatni orniga bosh bolib turgani yaxshimasmi, else holadita nma bolsin , tagni bosqanda search qande ulavorsam boladi shuni ilochi bolsa kod bilan shuntirib ovorsez",
      "Assalomu alaykum men fastAPI darslar bo'limini ko'ryotgandim shunga qo'shimcha documentatsiya o'qish uchun resurslar tavsiya qila olasizmi masalan documentatsiya yaxshi berilgan biror sayt",
      "Asalomu aleykum Nimagadir telegram quruhning chatlari ochib ketdi yordam bervorila iltimos.",
      "Asalomu aleykum Nimagadir telegram quruhning chatlari ochib ketdi yordam bervorila iltimos.",
      "Assalomu alaykum, drf da user modeli save methodini override qilishni o'rganayotgan edim, bu code da nega unreachable deb xatolik beryapti? javob uchun rahmat",
      ". simplejwt o'rnatganimdan kn negadir run qilib bo'lmayapti?",
      "bu xatolikni qanday to'g'irlasam bo'ladi",
      "xatolik run qilsam yordam berib yuboring. iltimos toliq tushuntiring",
      "ishlamayabdi. shunga yordam kerak edi.",
      "Assalomu alaykum men html darsini tugatib bolib oxiridagi loyihani yuklamoqchi edim yuklab bolmayapti. Validation xato diyapti",
      "Assalomu alaykum Loyhani hostinga deploy qilganimdan so'ng shunaqa xato chiqyapti?",
      "Assalomu alaykum, csrf tokenni qo'shdim, ln xatolik takrorlanyapti",
      "mentor Assalomu alaykum fastapi darslarini ko'ryotgandim sign up qismini qilyotganimda userning id sini optional qilib bersam ham requirement sifatida qarayapti va idni bermay post request yuborsam 422 error qaytaryapti aslida id ni aftomat o'zi berishi kerak edi shuni qanday to'g'rilasam bo'ladi",
      "mana",
      "savolim bor edi . Manga funksiya bor username birinci harfini olip rasmga yozip beradgon . Post profil ocetgan acountda agar rasm qoymasa ozi avtomatic tarzda rasm qowadi owa funksiyani defoult ga bervorsa boladimi ImageFields da modelda , yoki save funksiyasi ichida yoziwim keremi",
      "mohirdev hplatformasini html boʼlimidagi vazifani bajarib yuborib boʻlmayabdi oxirida shunga bir etibor beringizlar iltimos",
      "fastapi darslarida login qilishda token olish uchun fastapi_jwt_auth paketidan foydalanilgan ekan lekin hozir shu paketdan foydalansam xato beryapti shuni qanday qilsam bo'ladi uni o'rniga biror boshqa paket bormi foydalanishga yo o'zini ham to'g'rilash mumkinmi",
      "Asalomu aleykum Nimagadir telegram quruhning chatlari ochib ketdi yordam bervorila iltimos.",
      "rasmni fayldan yuklamoqchi edim ruscha nomdagi fayldan yuklab bolmaydimi yoki boshqa hatolik bormi",
      "logout qilsam profildan chiqmayaptida mabunaqa hatolik beryapti nimaga unaqa bo'lyapti?",
      "instagram proyektida email bilan phone_number ni royhatdan o'tkazsam shu xato beryapti",
      "bu view qismi men ko'p narsani serializerda yozganman",
      "postmanda request jo'natganman. admin panelga save bolyapti lekin bu yerda hato korsatyapti",
      "Salom hammaga mana shu moammoga yordam berib yuborilar!",
      "assalomu aleykum Django: pip install pipenv qilib kurdim va cmd dan qanday tugirlab path qilsam buladi",
      "xoz man fast api ga bazani toldirish uchun python script yozdim ln iwlamadi qatida xatosi bor bilganla etsin",
      "Assalom alekum <link rel=\"stylesheet\" href=\"./css/main.css\"> da ulanish amalga oshmayapdi?",
      "shunday xatolik bo'lyapti pycharmda env ochganimda",
      "xato takrorlanyapti o'zgarish yoq siz aytgande qildim",
      "Assalomu alaykum! button tegida transition ishlamayapti. Nima qilsa bo'ladi? hover qilib ishlatsam boshqa xossalar ishlayapti, lekin transition ishlamayapti. oddiy tegni o'zida xech qaysi xossa ishlamayapti",
      "shunday hato bo'lyapti",
      "Assalomu alaykum shu yerda hitcount modulini o'rnatganmna lekin tanimayapti.",
      "Assalomu alekum django 5 dan, django 3 dagi 'django.contrib.auth.urls' qanday farq qiladi qanday o'zgarishlar bor?",
      "shu xatoni javobini bilmayapman",
      "siz aytgandek qildim lekin shu xato beryapti",
      "assalom alekum CSS da live ni urnatgan edim go live qilsam local host chiqayapdi ?",
      "qayerda hato bor",
      "darsdagida esa shunday ekan",
      "Assalam alekum Nega Bundey chiqayapdi?",
      "shunday hato yuzaga keldi",
      "to'g'riladim yordam uchun rahmat",
      "yaxshimisiz menda bir muammo bo'lyapti. ba'zida server qata ishga tushganda 1 ma'lumot qayta yozilib qolyapti shuni qanday oldini olsa bo'ladi",
      "biz kurib borayotgan video darslikda {% extends, block endblcok %} kurinishi",
      "bu maniki",
      "Muamo typingda qiyinchlik buvoti chaqirib beradgan extensionlar yoq cssda ham suzma suz kiritilmoqdaa",
      "Asalomu aleykum hormeylar nega o'rtada home.html di chiqarib bo'lmayapti block content endblock content lar yozilgan",
      "Assalomu alaykum. Python asoslari OOP bo’yicha topshiriq ichidagi shu 5-gap mazmuniga ozgina tushunolmadim. Iltimos shunga izoh bera oladiganlar yordam bersalaring minnatdor bo’lar edim. Javob uchun oldindan rahmat.",
      "Assalomu alaykum, JS bo'limidan topshiriqlarni jo'natgan edim, qachon baholanadi? javob uchun rahmat",
      "bu serverga kirish uchun linkdan xato kod kelyapti",
      "Ассалому алейкум. Python курси буйича дасрларнинг текст куриниши видео остида колдирилган деяпти. лекин топа олмаяпман???",
      "Ассалому алейкум. Python курси буйича дасрларнинг текст куриниши видео остида колдирилган деяпти. лекин топа олмаяпман???",
      "Asalomu aleykum hormeylar static fayllar o'zidan o'zi ishlamay qolishi mumkunmi?",
      "section va aside ning o'rtasini ajratish yo'li bormi",
      "ustoz nimaga base.html da home.html chiqarib bo'lmayapti umuman topa olmayapman nimadanligini",
      "Asalomu aleykum hormeylar yangilik qo'shmoqchi bo'lsam bitta yangilikdi ichiga 2ta 3ta rasm va body kiritmoqchi bo'lsam qandey qilsam bo'ladi masalan adminkada bitta rasm qo'shdim i yana dobavit qilib yana rasm qo'shish uchun nima qilish iloji bormi shundey qilishdi",
      "Asalomu aleykum hormeylar mana shu fan-texnika, sport, o'zbekiston, iqtisodiyot buttonlardi bosganda tagidagi yangiliklar shu bosilgan categoriya bo'yicha chiqishi kerak nima qilsa bo'ladi?",
      "python makemigrations shu comandani tersam hatolik chikyapti",
      "nega bunday hatolik beryabati",
      "asolomu aleykum yordam berinlar",
      "Assalomu alaykum, shu yerda rasmlarni chiqarmayapti, biladiganla yordam bera olasilarm iltimos?",
      "Men barcha applarni apps degan papkaa yaratib shu papkani ichida yaratmoqchi edim shunday qilganlar bormi menda applarni ko'rmayapdi",
      "Menda Brauzerni yuklashda muommo bo'layabdi.Bunga sabab nimada",
      "АКШ да кайси дастурлаш тилини ва йуналишини урганган яхши? бэкенд жуда хам оммалашиб кетган экан ва ракобат жуда катта,кайси йуналишда окиб ишга кирса булади?",
      "Assalomu alaykum, shu rasmda 1 va 2-usuldan qaysi biri yaxshiroq. Qaysi biri qo'llansa kod hamma tomondan yaxshiroq chiqadi. Javob uchun oldindan rahmat!",
      "mana shu kichkina rasm va asosiy qismlarni qanday qilib bir xil qilsa boladi men darslikdagiga oxshatib yozyabman negadiir oxshamayabti",
      "mana kodlarini ham tashladim korib bering",
      "mana shu darslikning 9 daqqiqasidan keyingi 1 daqiqasiga tushunmadim yani <header> qismini polni belgilab yoq qilib orniga <div> qoydilarmi tushunmay qoldim iltimos yordam beringlar tez bajarganlar men tushuna olmayabman",
      "Ассалому алейкум яхшимисилар, pycharm да кайси плагинларни орнатишни тавсия киласизлар яхшилаб созлаб олиш керак еди кулайликлар учун",
      "mana shu rasmni inline block qilmoqchi edim qanday hato bolyabti aytb yuboringlar",
      "migrate qilganimdan so'ng ham db sql shunday chiqyapti",
      "\"detail\": \"Authentication credentials were not provided.\" Settingsda hammasi togirlab chiqdim lekin baribir shu hato chiqayapti",
      "Asalomu Aleykum Ishga topshirvotum va testagi savolini chunmadim. Yordam bervorila iltimos",
      "yordam bervorila iltimos",
      "Men file ocha yangi olmayapman shunday xatolik diyapti",
      "Men shu yerda nima xato ekanligini topa olmayabman. Yordam berib yubora olasizlarmi? Mavzu: Queryset va model manager",
      "Men hozir full stack python kursida bootrstrap darslarini ko'ryapman vazifalar berilgan, videoga biriktirilgan pdf fayli joylaganmiz deiylgan qani shu pdf qaerdan topamamiz odingi css darslarni xam qidirib qidirib telegramdan topgandim nega darslarni tagida materiallar joyda yoq?",
      "Assalomu aleykum popular postni chiqarmoqchi edim xato beryapti qanday togirlasam boladi nimada xato",
      "Tayyor youtube video biriktiribsizlar xech bo'lmasa materiallarni qoyib qoyinglar",
      "yordam berib yuboring. commentlist ni chiqarmoqchi bolyapman lekin primary key berganman",
      "mentorlar bormi svollarga kim javob beradi?",
      "Men hozir full stack python kursida bootrstrap darslarini ko'ryapman vazifalar berilgan, videoga biriktirilgan pdf fayli joylaganmiz deiylgan qani shu pdf qaerdan topamamiz odingi css darslarni xam qidirib qidirib telegramdan topgandim nega darslarni tagida materiallar joyda yoq?",
      "Tayyor youtube video biriktiribsizlar xech bo'lmasa materiallarni qoyib qoyinglar",
      "Men hozir full stack python kursida bootrstrap darslarini ko'ryapman vazifalar berilgan, videoga biriktirilgan pdf fayli joylaganmiz deiylgan qani shu pdf qaerdan topamamiz odingi css darslarni xam qidirib qidirib telegramdan topgandim nega darslarni tagida materiallar joyda yoq?",
      "Tayyor youtube video biriktiribsizlar xech bo'lmasa materiallarni qoyib qoyinglar",
      "shu xatoni togirlashda yordam berib yuboring iltimos",
      "menda savol bor edi , agar tashqaridan bir proyectni olib ishlatmoqchi bo'lganizda uni python versiyasi bilan sizning python versilari to'g'ri kelmasa nima qilish kerak",
      "Asalomu aleykum hormeylar nimaga utils dan datatime_safe di topolmayapti?",
      "admin qismida shunday chiqyapti",
      "Assalomu aleykum, kursda 6 oylik kurs tugasa ham keyinchalik ham saytga kirib yana darslarni koʻrish mumkinmi?",
      "Mana ustoz yuqorida yozdim.",
      "Vazifani jo'natdim,qancha vaqtlarda tekshiriladi?",
      "shunday xato chiqyapti",
      "qanaqa xatoli chiqyapti togrilolmayapman",
      "Assalomu Aleykum, man bo’lib to’lashga kurs sotvolgandim har oy 15chisida to’lov qilish kerak kartamga yetarlik mablag’ni joylab qo’ysam, to’lov avtomatik tarzda yechib olinadimi, yokigi biror bir hisob raqamga tashlash kerakmi?",
      "Assalomu alaykum, , mana shu yerga vazifani bajarib linkini joylagandim, iltimos vaqtingiz bo'lsa, tekshirib bersangiz.",
      "Assalomu alaykum yaxshimisizlar menda shunaqa xatolik berayabdi.",
      "Asslomu alaykum",
      "yangi xatolik",
      "Assalomu Aleykum, kartadan pul yechib olinmadi, kimga murojaat qilishim kerak, man bo’lip to’lashga kur sotib olgandim.",
      "Assalamu Alaykum Yangi postni <articles/new/> page da qo'shilyaptida saqlash qilganimda yana o'sha pageda qolib ketyapti , nima qilish kerak maslaxat beringlar!",
      "Savol positon: absolute; va position:static; qoidalari bo'yicha? Position xossasi absolute qiymatiga ega bo'lgan payti biz ko'rsatgan foiz (%) qiymatimiz eng yaqin positioned avlodining content va padding qiymatlari yig'indisiga (content+padding) nisbatan o'lchamga ega bo'ladi. Savol shuki foiz (%) qiymati eng yaqin positioned avlod elementga nisbatan emas ajdod elementga nisbatan o'lchamga ega bo'ladi-ku! Shu joyida biroz adashmaganmi? Misol uchun: <div class=\"positioned-box\"> <div class=\"absolute-box\"> Absolute-box </div> </div> bunda absolute-box uning ajdodi positioned-boxga nisbatan o'lcham oladi-ku! .positioned-box { margin: 50px; position: relative; width: 800px; padding: 50px; background-color: yellow; } .absolute-box { position: absolute; width: 50%; background-color: red; }",
      "fastapida ishlayotgandim shunday xatolik beryapti",
      "assalomu aleykum ustoz sizda sovolim bor edi. Xullas, FastAPI da real project qilsa boladimi yani mukammal project, yoki projectga DRF qo'shish shartmi",
      "Asalomu aleykum hormeylar mana shu djangoni tagida qizil chiziq chiqib ko'rmey qoldi windows qilgan edim shundan keyin shunaqa bo'lib qoldi nimadan shunaqa bo'lishi mumkin",
      "savol Assalomu alaykum how to fix?",
      "vaqtiz boganda aytvoring",
      "Assalomu alaykum shu library projectni ga deploy qilmoqchi edim shunaqa deyapti pullik bo'lgani uchun shunaqa qilyaptimi yoki to'g'irlasa bo'adimi",
      "Assalomu aleykum shuni vaqtiz boganda karavoring",
      "assalomu alaykum, man vscodeni boshqattan òrnatgan edim, Doctype, head, tittle shula bosh harfini bosib yozsam.aftomat chiqardi qogani, hozi chiqmayapti",
      "kirsam 2 oyga beryapti 1yilgamas",
      "htmlni rezumi yuborish bòlimida zip papkani yuborib bòlmayapti validatsiya xatosi deyapti nima qilsam bòladi",
      "GitHub orqali qanday yuborsam bòladi",
      ", - men qilayotgan saytimda batafsil degan knopka bosilganida har bir odamni ma'lumotlari chiqishi kerak edi bu ma'lumotlar dinamik xolatda kiritilganida hammasida bir hil ma'lumot chiqib qolyabdi biladigonlar bo`lsa yordam berib yuboringlar iltimos",
      ", - men qilayotgan saytimda batafsil degan knopka bosilganida har bir odamni ma'lumotlari chiqishi kerak edi bu ma'lumotlar dinamik xolatda kiritilganida hammasida bir hil ma'lumot chiqib qolyabdi biladigonlar bo`lsa yordam berib yuboringlar iltimos",
      "Assalomu alaykum. Heroku server hali ham bepulmi yoki o'zgarganmi? Sayt boshqacha bo'lib ketibdi.",
      "Assalomu aleykum yaxshimisiz , gituh student page olganimni qadan tekshirib bilsam boladi menga emailga xabar kelmadi, sorov jonatqanimga 1hafta boldi oshanga",
      "assalomu alekum, nega bunday hato bervotti iltimos yordam bervorila",
      "Assalomu aleykum yaxshimusiz, aka github student page kirsam faqat shu turipti xozir sorov xali tasdiqlanmaganmi emailga xabar kelmadi",
      "nega bunday xato chiqyapti?",
      "Assalomu alaykum mohidev sertificatini olish uchun nima qilish kerak yani qaysi loyihalarni qilgan bo'lishi kerak",
      "Assalomu alaykum, blogProject'da article'ga comment uchun class yaratdim. Va admin orqali comment qo'shishmoqchi bo'ganimda shunday muammo yuzaga keldi. Qanday xatolik mavjud? Javob uchun oldindan rahmat!",
      "assalomu alaykum men quydagi textni chiqarmoqchiydim (albatta qavslar va birtirnoqlarsiz) lekin unga berayotgan uzgaruvchi menga tuple kurinishida qaytapati ushani oddiy kurinishda qanday qilib qaytarsam buladi.",
      "Assalomu alaykum, static fayllarni browser ko'p hollarda o'qimay qolyapti. Shunaqa 304 xatolik kelib chiqyapti. Buni qanday oldini olsa bo'ladi.",
      "assalomu alaykum man kursni deyarli tugatdim sertifikatni olish uchun nima qilishim kerak boladi?",
      "Assalomu alaykum to'lov xaqidagi muammolarni kimga yozaman",
      "шунака хатола боляпти умуман ишламаяпти нма клишим кере",
      "Assalomu alaykum, html da Job Application vazifasini tayyorlab zip format da jo'natib qo\"ydim , shuni baholab bering",
      "Assalomu Aleyko'm iltimos yordam berib yuboringlar man loyihani digitial oceanga deploy qivotganidim hamma narsasini tayyor ishlavotti faqat gunicorndan tashqari gunicorn --workers 3 --bind config.wsgi mashi commanddan keyin mashnaqa xatoli kevotti iltimos kim bilsa yordam berib yuborsin",
      "assalomu alekum salomatmisz?oldingi safargi meetingda Epam ga topshirishda resumemni bir nechta templtelarga asoslanib yangiladim degan edingiz. o'sh templatelarni share qila olasizmi?",
      "men 3 marta html Job Application Form xato yuboribman endi boshqa yubora olmaymanmi menga qanday yordam bera olasiz ? 4 martaga yubora olmayapman",
      "mono xato togirlanmadi xamma narsani ochirib boshqattan ornattim foydasi bomadi yoq papkani korsatyapti nima qilsam boladi",
      "mono hatolidi kormadizmi",
      "Assalamu alaykum ustoz mobodo webrtc haqida biron bir loyiha qilmaganmisiz, anydesk ga o'xshash web application qilmoqchi edim example yoki yo'nalish kerak edi agar bo'lsa",
      "шунга вактиз боганда караворинг",
      "Assalomu alaykum everyone bu yerda muammo nimada rest framework ni tanimayapti VS Code ta yozyapman code...",
      "Ustoz shu yerda nima xato ketayabdi ekan vaqtiz bo'lsa bitta qarab berasizmi, 3-rasmda terminalda kiritganda tepadagisi signup da kiritganim pastdagisida signin dagisi, admin da esa ko'rinayabdi yangi User bo'lib",
      "asolomu aleykum shu hatoga yordam berin",
      "men kritkan rasmni korsatmayapti xatolik nmadan bolishi mumkun korberin",
      "Assalomu alaykum. manda user va company model bor. aytaylik bitta user 1ta kompaniyada ro'yxatdan o'tadi va o'sha kompaniyaga client bo'ladi deylik. lekin boshqa kompaniyalar uchun o'sha user client hisoblanmaydi. bitta db. shuni qanday qilishga hech fikr kemayapti. nima maslahat berasz?",
      "Assalomu alaykum, goodreads da register users videodarsligini o'rganayotganedim, quyidagicha xatolik chiqyapti, buni qanday to'g'irlashim mumkin? javob uchun rahmat",
      "Asalomu aleykum. pseudocode imni tekshirberila iltimos, shartga tog'ri javob bervommanmi? Tog'ri ketmaketlida joylashkanmi?",
      "xatolik qandayligini korsatmayapti belglagan urlimga krmayapti 404 beryapti qayerda xatolik bolyapti korberin",
      "Assalom aleykum 2 ta savolim bor .Manga frontend unchali backend dasturchi bo'lmoqchiman.Shu sabali kursni frontend qismini tashlab ketib python asoslaridan darslarni boshladim.Shu tartibda davom etsam bo'ladimi?Yoki frontenddan boshlaashim kerakmi? for mavzusiga keldim.Mavzuga oid masalalar juda kam ekan.Ko'proq masala yechib hozirdan algoritmimni kuchaytirmoqchiman lekin har bir mavzuga oid yaxshi masalalar topa olmayapman.Nima maslahat berasiz?",
      "assalom alekum, man django asoslari ( yangi ) -darsidan 17-dars ' News list and detail page ' ni kurib to'liq yozdimda, lekin url ni topolmayapti",
      "Yangiliklar sayti shablonini djangoga qo'shish darsida kelib chiqgan muammo menda to'g'irlanmadi. nima qilsam bo'ladi",
      "telegram bilan login qilishda redirect ishlamayabdi shu nimadan bo'lishi mumkin...? login with telegram qilib nomerimni kiritayabman telegramimga sms kelayabdi confirm ni bosdim va bu yerda ham ismim va profile image chiqayabdi lekin hech qayerga redirect qilmayabdi va admin da ham saqlamayabdi yangi user qilib",
      "assalomu alekum men kursni tugatdim! Sertifikat olish uchun nima qilishim kerak boladi?",
      "Assalomu alaykum, ecommerce sayt uchun productni create, update, delete qilmoqchi bo'lsam, permission_classes ga IsAdminUser beramanmi, yoki rollar bo'yicha qilinadimi?",
      "Assalomu alaykum ahost ga proektni joylamoqshiman lekin proekt python 3.12 da ishlangan lekin ahost ta 3.9 support qilarkan deploy qilsam ishlab ketadimi yoki xatolik beredimi... oldinnan rahmat...",
      "Ushbu misolda dastur 2 sonini 5 marta chiqaryapti.Shu 2 sonini har birini bir qatorda yozmasdan yonma-yon yozish uchun nima qilsak bo'ladi? 2, 2, 2, 2, 2 shaklida",
      "assalom alekum , djangoga template ulashda static fayl ichiga hamma ko'rinishlarni berdim, lekin static fayni uqisayam css ni uqimayapti, va 2 ta css fayl mana bunday ko'rinishda arxivdan chiqibdi , qoganlari odatiy turibdi",
      "Userni ichidagi hamma obektlarni olib templatedagi table chiqarmoqchi edim, lekin chiqmayapti yordam berilar",
      "Assalomu alaykum. , kechagi videosuhbatni zapisi bo'lsa tashab qo'ying. Rahmat oldindan!",
      "yordam berib yuborizlar",
      "Assalomu alaykum Experience shunday qilish uchun Nima qilsa bo'ladi. Yordam bervorizla",
      "Assalomu alaykum FastApi da docs va redoc larga login parol orqali kirishni qanday amalga oshirsa bo'ladi, yani faqat ruxsati borlar ko'rishi uchun",
      "Assalomu alaykum men men pipenvni \"addapp\" papkasini ichiga urgatganman qanday qilib men aynan shu vertual muhitni interpretatorini qusholaman.",
      "Assalomu alaykum ustoz savol bor edida Yandex contest, codewars, leetcode, robocontest shu va shu kabi sport dasturlashdan competition qiladigan oddiyroq web qilib ko'rmaganmisiz mobodo, example kerak edida google dan nima deb qidirishga ham xayronman",
      "Assalomu alaykum rasmni yoki yozuvni ustiga bossam yangilik haqida to'liq ma'lumot chiqmayabdi. Bilganlar yordam qilib yuborizlar",
      "Assalomu alaykum! , rasmda bitta productni detaili ko'rsatilgan. Productlar categorylarga tegishli. Shunga ko'ra ularning propertylari ham har xil . Bu holatda ham siz qilgandek, har bir property uchun alohida model qilinadimi productga bog'lab, yoki categoryga bog'lanadimi? Yoki umuman boshqachami?",
      "Assalomu alaykum, send_mail ishlamayapti. Google settingsdan kerakli narsani turn on qildim, lekin baribir shu xatoni beryapti",
      "Assalomu alaykum istalgan yangilini ustiga bossam kirmayabdi. Bu maxalliy html file Bu news detail html bir qarab berizlar",
      "Assalomu laeykum shunaqa xato berayapti bu ahostni ozidanmi yo menda xatolik ketganmi",
      "ahostga joylaganimda rasm chiqmayapti media rootni videoga oxshash qilib ham basedir ham qildim lekin natija yoq",
      "Assalomu alaykum hozirda pythonda ham typelarni belgilab ketish requarimentga aylanganmi masalan hozir ko'plar javascript o'rniga typescriptdan foydalanishadi aslida jsda ham yozaverasiz lekin type checking qilmaydi xuddi shunday men fastapi ni documentatsiyasini ko'ryotgandim shu documentatsiyada ko'rgandim pythonda ham shunday narsa borligini buni bilish hozirgi kunda qanchalik muhim?",
      "Assalomu aleykum negadir xatolik beryapti endi boshludim Fast Api ni",
      "assalomu alaykum fastapi ishga tushgandan keyin har reload bo'lganida shunday error bilan reload bo'lyapti shuni qanday to'g'rilasa bo'ladi hamma joydan qidirib ko'rdim lekin tuzukroq ma'lumot topolmadim",
      "'lumot_ko'rinmayapti Assalomu Alaykum! for orqali modeldagi ma'lumotlarni brauzerga chiqaradigan view yozdim va htmlda for orqali ko'rsatmoqchi bo'ldim ammo ma'lumot home sahifada ko'rinmayapti, asosiy sababi for dan deb o'ylab h1 yoki shunga oxshash taglardan foydalanib har xil narsalar yozib kordim ham lekin baribir ko'rinmadi.",
      "shu savolga qarab yuboring",
      "Assalomu alaykum, vadan amaliy vazifalarni tekshirib berilar",
      "payme apini ololmayapman yordam kerak",
      "# guruppadagilar hash() funksiyasi qaytaradigan hash qiymat bilan id funksiyasi qaytaradigan qiymat orasida bog'liqlik bormi? Ikkalasini orasidagi farqni tushunmayapman.Xotirada qanaqa jarayon bo'layotganini ham",
      "assalomu alaykum bu vazifani silkasini joylab o'zini git hubga yuklab qo'ysam ham bo'ladimi?",
      "API bilan IPni qanday farqi bor. Telegram bot uchun bular qanday vazifalarni bajaradi. Youtube va instagramdan video skachat qilishda bularni farqi qanday",
      "manabu yerda images ga nimani qushish kerak deyapti bilolmayapman",
      "; bilan ; qiymatini tushuntrib berilar, tushunmadim unchalik",
      "shartmas, hashtaglardan foydalaning ,",
      "mohirdev bergan couponni uji ishlatilgan deyapti, jetbrains. Lekin men bu birinchi olishim, nima qilishim kk?",
      "Assalomu alaykum OOP bo’limi uchun amaliy topshiriqni tekshirib bersangiz",
      "Salom 👋. Men djangoni endi urganayapman va men rasmda kursatilgandek qilib publisher managerini yaratdim lekin bunda ishlatilingan codlar xuddi vedio darslikdagi kabi bo'lishiga qaramay 2-rasmdagi xatolikni qaytaryapti. Xatolikni qayerdaligini kursatib turibdi lekin men buni qanday to'g'rilashni bilmayman vedioda ham bunga doir narsa aytilmagan. Xatolikni qanday to'rilash mumkin toki men News.publisher.all() cammandasini yozganimda menga statusi draft bulgan barcha objectlarni qaytarishi kerak.",
      "lar ignore qilishyapti, javob yoq",
      "Assalomu alaykum Darslardagi Task larni tekshirib berishadimi topshirgamdim... Github Link qoldirilgandi",
      "shunday hatolik yuzaga kelyapti",
      "shunday deb habar chiqyapti va login qismiga o'tmayapti",
      "404 Page ni siteda ochganda about bulimi takrorlanb chiqmoqda 404 html chiqara olmadm yordam berib yuborng",
      "Salom 👋 . men django rest_frameworkni urnatib bazi model , serializers, view, urls lar yozib ishga tushurdim lekin manashunay xato qaytarayapti ummuman bu yerda qayerda xato borligini ham bilolmayapman .",
      "xato beryapti template ishlamayapti",
      "shunday xatolik chiqyapti",
      "ustoz shuni skachat qisam boladmi?",
      "shunday xatolik yuzaga kelyapti",
      "kimdir yordam bervorolidimi?",
      "Assalomu alaykum bir betdan ikkinchi betga otayotgan payt qanday animatsiya qõshadi yani HOME dan ABOUT ga õtish",
      "Assalawma aleykum Omborxona tizimi MOCK Task topshiriqni ishlagandim... Lekin qabul qilinmagan, ustoz dan Javob yozilmapdi Sababi nimadaligini bilmayapman...",
      "shunday xato chiqyapti",
      "Assalom aleykum, django proektni front qismi reactda qilingan o'shani qanday bog'lasam bo'ladi proektga?",
      "registerni test qilsam xato qaytaryapti",
      "Bosh sahifada yangiliklarni kategoriya bo'yicha ko'rsatish 1-qism shu video orqali: src ={{ news.image.url}} command ishlamayapdi nima qilsa buladi",
      "nma qilsam buladi",
      "shunday xatolik yuzaga kelyapti",
      "accsess token kelmayapti",
      "shunday hatolik chiqyapti",
      "assalom alekum hammaga ubuntu 22.04 versiyasini ustanovka qildim kim qanaqasini ishlatadi ubuntu main yoki ubuntu pro?",
      "bulmadi",
      "assolomu alaykum ustoz fastapidan loyihani ko'rib berasizmi link",
      "Saytga kirish uchun ulangan telefon nomerim. Sim kartam oʻchib kuyib ketdi endi saytni ishlatishimda muammo boʻlmaydimi. Shunchaki oʻsha nomerni va parolni kiritib ishlataveramanmi yoki qachonlardur. Oʻsha kuygan nomerimga kod joʻnatib qolishi mumkunmi Yana bir savol. Yopiq guruhlarga qoʻshilgan telegram profilimni oʻchirib yubormoqchiman boshqa profile ochib saytdan oʻtib yana yopiq guruhga ulanib olsam boʻladimi",
      "aniqroq tushunitra olaszmi",
      "izoh bera olaszmi ?",
      "Django==5.0.3",
      "Assalomu alaykum papkada html file ochsam <> bu belgini korsatib qolyapti html bolmayapti qayerda xato qilyapman yordam bering..",
      "Assalamu aleykum va rahmatulloh Pipenv vertual muhitini Install qilib bo’lgach uni ishlata olmayapman, (pipenv --version) deb yozsam (is not recognized) degan yozuv chiqmoqda Nima qilsam bo’ladi ? Darsliklarni davom eta olmayapman to’xtab qoldim",
      "Salom. Login sahifa yaratgandim o'tmoqchi bulsam shunday xatolik qaytarayapti.",
      "Hello everyone... Task boyicha Tavsiya etilgan postlar shiqsin deyilgan manimcha a...",
      "Test yechish loyihasida test yechayotganda yangilashni bosganda o dan boshlanayapti shunga yangilash bilan orqaga tugmasini bosganda ham shu joyda qoladigan qilish kerak nima maslahat berasiz",
      ". Quyida rasmdagi kodni ishlamasligiga sabab nima?",
      "mavzu: Login_required dekoratori va LoginRequiredMixin savol: account/login sahifasidan logout qilgandan keyin ham foydaluvchi chiqib ketmayapdi qayta kirish AynonumusUser chiqarib bermadi nima qilsam buladi",
      "rahmat tugri yunalish uchun!!!",
      "manashu xatolik nimadan bo'lishi mumkin kim biladi",
      "Salom 👋. pipenv vertual muhitiga django restframeworkini o'rnatib fayilida \"from rest_framework import serializers \" bo'yrug'ini bersam rest_frameworkini tanimayapti install packagega ham qushganman nega bunday bulayotgan bo'lishi mumkin.",
      "Assalomu alaykum. dagi kodim va migratsiya qilayotgan olgan xatoligim. Qanday togirlasam boladi?",
      "Assalomu alaykum . men bir kitob qushilsa uni yana qushib bulmasligi uchun valditsiya yozgandim lekin validatisiyamdagi berilgan xatolini matnini (statusini chiqarmay) Boshqa narsa chiqaryapti qanday qilib ustoznikidek statusda yozilgan xabarni chiqarishim mumkin.",
      "Assalomu alaykum Django jazzmin admin panelida region tanlanganda shunga tegishli district tanlash inkoniyatini qanday qilsa bo'ladi, custom.js bilan ajax qo'llab ko'rdim foyda bermayabdi",
      "??? bu usul to'g'rimi",
      "shunday xatolik chiqyapti qanday togirlasa boladi",
      "assalom alekum ubuntu ustanovka qildm va manga nmala ustanovka qilishim kerak",
      "Assalomu alaykum. Oxirgi videosuhbatni yozib olingani bo'lsa tashaberolasizmi?",
      "Assalomu alaykum. Railway da deploy qilguncha mana shunaqa korsatyabdi va deploy qilmayabdi, qanday togirlasa boladi",
      "schema togri yozilgan lekin docsda korsatmayapti",
      "❕Nega ga qo'ysam blog rasmlar ko'rinmayapti, lekin papkasidan ochsam korinyapti. Hamma elementlarni remga o'tkazmasimdan oldin ko'rinyotgani netlifyga qoysam ham?❓❓❓",
      "Kimdir javob beradimi?",
      "onlayinmi ?",
      "Savolim boridi hozir HTML da Job application yasash darsiga keldim bu Yoda ozi yozsa boladigan boshliq bor u yerga kod yozaymi yoki file jonataymi?",
      "Assalawma aleykum Js kursi sabaqlarinda amelyat az boldi, kurs aqirindagi Amaliy vazifa ga onsha tusinbedim. Usi bilgenlerimiz back end ushin jeterli bolama? Js bilimlerdi adimba adim qalay terenirek uyrensek boladi? Juwap ushin aldinnan raxmet",
      "Assalomu alaykum yaxshimisizlar shu Notification Kanaka kilip ishlatadi yoki yoki framework bormi",
      "Assalomu Aleykum birinchi rasmda ta uchun bitta container ishlatilganmi ikkinchisi meni websaytim hech birinchisiga uxshmayapti 5 ta elemetni bitta containerga qilish keremi yo 2ta 3 ta mi yordam bervorilar tugatganlar?",
      "Assalomu Aleykum birinchi rasmda ta uchun bitta container ishlatilganmi ikkinchisi meni websaytim hech birinchisiga uxshmayapti 5 ta elemetni bitta containerga qilish keremi yo 2ta 3 ta mi yordam bervorilar tugatganlar?",
      "Assalomu alaykum, ahostga deploy qilayotganda shunday xato kelib chiqdi. Qanday to'g'rilasa bo'ladi? Hostingni eng kichik ta'rifini tanlaganman. Javob uchun oldindan raxmat!",
      "Assalomu alaykum, ahostga deploy qilayotganda shunday xato kelib chiqdi. Qanday to'g'rilasa bo'ladi? Hostingni eng kichik ta'rifini tanlaganman. Javob uchun oldindan raxmat!",
      "aHostga Deploy qilgandan keyin shunday xatolik kelib chiqmoqda. Ya'ni sayt ishlamayapti. Shunga ko'rsatma berib yuboringlar. Raxmat!!",
      "Javob qaytaring plz",
      "Kim javob beradi? javob bermasa kimga murokat qilishim kerak? O'zi ni lichkasi bormi beringlar",
      "Assalawma aleykum Juwap bolmay atir edi Keyingi basqishqa otiw kerek edi",
      "men login qilinayotgan vaqtda username or email qilmoqchi bolyapman lekin username_or_email field yoq deyapti",
      "Assalomu alaykum men HTML da project ni bajarib yukladim va muvvaffaqiyatsiz boldi endi qayerda xato ekanini bilsam bo'ladimi?",
      "endi tokenni yangilash paytida userni topa olmayapti",
      "Assalomu aleykum vazifani kecha yuklab qo'ygandim,keyingi modulga o'tib ishni davom ettiraveraymi?Yoki kutib turaymi mentorning bahosini?",
      "-Assalomu alaykum men HTML da project ni bajarib yukladim va muvvaffaqiyatsiz boldi endi qayerda xato ekanini bilsam bo'ladimi?",
      "...",
      "Assalomu alaykum, saytni AHostga yukladim va Sayt serverda ishlayapti. Lekin media fayllar ko'rinmayapti. Menimcha media URL lar to'g'ri ko'rsatilgan. Lekin rasmlar chiqmayapti. Tepada va aHost Fayl menegerdagi fayllar strukturasi rasmi qoldirdim. Shunga ko'rsatma berib yuboringlar iltimos! Oldindan rahmat! Saytni manzili:",
      "Assalomu alaykum, saytni AHostga yukladim va Sayt serverda ishlayapti. Lekin media fayllar ko'rinmayapti. Menimcha media URL lar to'g'ri ko'rsatilgan. Lekin rasmlar chiqmayapti. Tepada va aHost Fayl menegerdagi fayllar strukturasi rasmi qoldirdim. Shunga ko'rsatma berib yuboringlar iltimos! Oldindan rahmat! Saytni manzili:",
      "Assalawma aleykum 2 kun aldin js amaliy vazifa ni orinlap edim. Korip jiberseniz uyreniwdi dawam eteyik",
      "rasm googleda chiqmaypti shunga yordam berselar",
      "maslan shu ko'rinishda bo'lsa bo'ladimi, kamchiligi yo'qmi? yoki css fayl yozib uni ulash kerakmi?",
      "assalomu laeykum live server ishlamayapti nimagadir qaerini no`tog`ri qildimmi bilolmayapman",
      "Assalomu aleykum, shu cdnjs sitedagi qaysi birini tanlash kerak,anu mayda icon lani chiqarish uchun shu site dan olasila diyilganu video darsda.Bu site yangilangani uchun topa olmayapman.",
      "Assalomu alaykum, dockerni qanday o'rnatsam bo'ladi",
      "Assalomu Aleykum, .env file nima uchun ishlatilinadi shu haqida batafsil malumot bera olasizmi?",
      "Assalomu alaykum. 1) OOP topshirig'idagi matnlarni json da ishlatdim. Keyin yuklab bilmaganim uchun dictionary dan foydalandim. Keyin mentor fayillarda ishlang deb yozdi. Buni txt fayili bilan ishlash kerakmi yöqsa jsonda ishlatsada boladimi? 2 ) Keyin buni zip qilib tashlaymizmi. Yoki kodni õzini tashlasa bõladimi. Hodisalar fayilini tashlash shartmi? Shunga tushinmadim.",
      ", savolim bor edi, shunaqa muammo bolganda qanday hal qilinadi? qidirib ham kordim, tayinli javob ola olmadim",
      "nimaga unaqa bolayabdi kim biladi",
      "mana",
      "mana",
      "tushunmadim?",
      "yoʻli bormi",
      "qanday qilib docker container filemga kirsam boladi",
      "nima qilsa boladi",
      "Assalomu alaykum men CSS kursini 18-darsiga keldim va u yerda rasmlar ishlatilgan rasmlarni qayerdan topsam boladi berilgan telegram linkda hech nima yoq",
      "Assalomu alaykum shu joyda button qo'llash kerakmi yoki boshqasini? shunga biroz tushunmadim, vazifani noto'g'ri debsiz.",
      "Hozr mening serverim dockerda va har bittasi alohida kontainerda va 2 ta databases bitta boʻlishi kerak boʻlgan proyektning bazasi alohida alohida boʻlib qolgan oldin nginx da vaqti bitta boʻlgan edi hozr yana bularni bitta qila olaman",
      "qayta yukladim, iltimos baholab yuboring.",
      "assalomu aleykum men django restda framework loyiha yaratdim uni ahostga frontend va backendni ulab joylamaoqchiman shuni qanaqa qilishni bilmayapman",
      "natija bir tekisda chiqmayapti",
      "Assalomu alaykum mentor yoki supporterlar qanday qilib hashteglarni tutishadi🤔. Masalan men deb yozsam buni mentor qanday ajratib oladi, yoki alohida xabar boradimi mentorga. Yoki oddiygina deb yozganimiz uchun mentorlar javob berib qolgan vaqt jim boʻlishadimi?",
      "qalban birgamiz usha narsani hardoim deb yozganimda bir uylab olardim 😂",
      "Assalomu alaykum, keyingi video chat, domen nomi orqali serverdan elektron pochta yuborish haqida bo'lsin, menda yuborganimda spam qutiga tushib qolyapti, shu haqda batafsil tushuntirib bering iloji bo'lsa",
      "Salom 👋. Men Postga Commet yozish uchun serializer asosida view yozgandim va post idsiga urldagi post idni biriktirb ketgandim lekin baribir post bush degan xatolik bervoti Error:",
      "assalomu aleykum djangoda admin paneldan ckeditor qoshgan edim lekin block quote va yana bazir stylelar templatega chiqmayapti shuni qanday to’g’irlasam bo’ladi",
      "Assalomu alaykum. Htmlda video va audio qoʻyishga qiynalyapman. Video/audoni linkini joylashtiryapman. Lekin chiqarib bermayapti",
      "Assalomu alaykum bu loyihani postgreslq da tayyorlab bo'lgach qande jo'natamiz yoki qanday bog'liqlik bo'lishini chizib oshanga silka jonatsak bo'ldimi?",
      "Assalomu aleykum vazifani yukladim lekin orada 2 ta tushunmagan joyim bo'ldi",
      "belgilagan joyimdagi formani ichidagi jadvallchalarni pasga tushirishga harakat qildim margin-bottom 5px; bilan lekin ishlamadi faqat tepadagilarga ishladi lekin kodni hammasini bir xil yozdim foydasi bo'lmadi",
      "Assalomu aleykum ! Umuman darslik körib bölmayapti. tinimsiz özini özi perezagruzka qivoryapti. Internet tezligim ham yaxshi. Nima qilsam böladi ?",
      "Assalomu alaykum shu joyi ishlamayapti nima sababdan dars 25 da",
      "Assalomualaykum mana shu proggrammani topoalmayapman qayerda bo'ladi?",
      "Assalamu Alaykum Logout qismi ishlamayapti negadir.",
      "Assalomu alaykum va rohmatullohi va barokatuh Htmlda Jop application yasash vazifasini joʼnatgan edim. Tekshiruv natijasi qancha vaqtda keladi",
      "yordamingiz kerak da xato beryapti togrisi tushunmayapman",
      "Assalomu alaykum yaxshimisizlar? Uzr offtopic yozyapman sabab yordam kerak ushbu muammoni hal qila olmayapman yordam bera olasizlarmi? ?",
      "Assalomu alaykum, Mohirdev Full Stack Python kursi mualliflari, Anvar aka Narzullayev, Ulug'bek Samig'jonov , Jahongir Rahmonov , Mukhammad Irmatov , mentorlar, , kurs, berilgan bilimlar uchun rahmat katta! 2023 yil may oyida kursni sotib olib, o'qishni boshlagan edim, 2024 yil august oyidan ishlay boshladim😇",
      "Assalomu alaykum css kursi davomida box'larni shunday joylashtirish otilganmi?",
      "Assalomu alaykum ustoz mobodo teachable machine dan foydalanib ko'rmaganmisiz loyihalaringizda shundan model training qilib bo'lganidan keyin sizga .h5 model beradi shuni ishlatishda muammo bo'layotgan edi. To'liq kod va xato bu yerda: Shunda sizda tayyor example yo'qmi",
      "nega har doim men savol so'raganimda javob bermaysiz? lar ishlayaptimi o'zi? Qachongacha kutamiz",
      "Rostdan savolga javob berishadimi.",
      "chap tomondagi infoga bermasimdan oldin fixed navbarni tagiga o'tib qolgan edi, bu tabiiy holmi?",
      "Zo'rg'a brand-namega berib chapga, navbarga berib o'nga surib kordim baribir chiqmayapti",
      "Ish arizasi yasash bo'yicha tushuntirish bersangiz",
      "Assalomu Aleykum, Html da 14-dars bo'yicha boshqa papkadagi imageni target qilolmayapman",
      "Bu manimcha javascript orqali qilinadi tashab ketsa bo'ladimi?",
      "❗️❗️❗️ Mohirdev jamoasida ishlaysizlarmi? Sizlarga pul to'lashadimi? Iltimos tuhsunmagan joyimizni tushuntirib bering❗️❗️❗️",
      "shuni css kodi qanaqa bo'ladi manabu to'lqin shakldagini nazarda tutyabman",
      "assalomu alaykum bir nechta djangoda backend yozib ko'rgan odamlar django DRFda backend ko'targaningda juda sekin ishlarkan deyishyapti men hali hech ko'p odam kiradigan saytni backendini yozmaganim uchun o'zim bilmayman chindan ham shundaymi va buni performanceini yaxshilash uchun nimalar qilish mumkin ko'p odam foydalanadigan saytlar uchun backend yozishganda nimalarga etibor berish kerak",
      "Assalomu alaykum. Dasturlash muhiti sifatida anacondani o'rniga VsCode dan foydalansak bo'ladimi? Yoki anaconda python uchun ko'proq qulayroqmi?",
      "savol",
      "database bilan bogliq qandaydur xato bolyapti yordam berila",
      "Assalomu alaykum, shu 2 ta divni padding yordamida pasga tushirdim. Bundan optimalroq yechimi bormi bilsangiz aytvoring",
      ", shuyerga tushuncha bervora olasizlarmi, aslida tushungandaymanu ammo .... faqat shartda qanday bo'lsa shunday ishlasha bo'ldi deyilgan uxam bor",
      "manashu 👆 joyda yashilni ichidagi yozuv bilan havorangni ichidagi icon lar vertikalni bir chiziqda boshlanishi uchun qaysiga qanaqa kod yozaman",
      "asalomu alekum savolim bor edi men html bolimida ohirgi vazifa job application yasashda tushunmadim shuni tushuntirib qoying",
      "Assalom aleykum vazifani yuklay olmayapman",
      "Assalomu alaykum username va password requird bulsa qaytadigan error uchun test yozayotgandim lekin xatolik beryapti yani rosti nima bulayotganini tushunmay qoldim bu test tug'ri tuzulmaganmi yoki funksiya xato tuzilganmi ? Xozi haligi Run .... OK chiqishi uchun nima qilishim kk",
      "Assalom alaykum, kurs davomida django qismigacha mavzularni oz bo'lsada tushunayotgan edim. Lekin django moduliga kelib mavzularni umuman tushuna olmayapman. Darslar reja bilan tuzilmagan, hali endi o'rganayotgan o'quvchilarga bunday tushuntirish juda qiyinlik qiladi. Darsni tushuntirayotgan o'qituvchi kursni tartibga solib, yangi o'rganuvchilarga tushunarliroq qilsa yaxshi bo'lardi. Huddiki kurs dasturlashda ancha vaqtdan beri ishlayotganlarga tuzilgandek. Keyin modullar o'rtasidagi umumiy bog'liqlik yo'q.",
      "Assalomu alaykum savol bor edi. Django DRF da project qilingan edi, uni ichida channels ham ishlatilgan frontendga websocet uchun. SHu projectni serverga qo'yishim uchun nimada run qilishim kerak. Internetdan juda resurs ko'rdim lekin deploy qila olmadim. Nimadan bo'lishi mumkin. Iloji bo'lsa deploy qilingan projectlariz bo'lsa yo'l ko'rsating. Oldindan raxmat. faqat shu xatolik chiqayapti zz qildi lekin yechimlarni hammaisni ko'rdim lekin to'g'rilay olmadim",
      "1 soat voqt yoqotdim",
      "Assalomu alaykum darslada sayt qilinvotga ishlatilgan rasm orqa fon uchun ishlatilgan rasmla telegram kanalda bor diyilgan u joyda hech qanday ma`lumot yoq qattan topse boladi?",
      "Assalomu alaykum yaxshimisizlar menda shunday xatolik chiqayabdi nima qilishni bilmay qoldim yordamlashib yuborizlar",
      "Iltimos manda umuman o'xshamayapti shu joyi qoldi faqat projectni",
      "Assalomu alaykum! saytga yangilik qo'shish CreateView darsida shunaqa bo'layabdi nima qilsam bo'ladi.",
      "Biladiganlar bolsa ham aytvorilar iltimos, shunday qiymat tavsiya etiladi yoki yoq?",
      "Assalomu alaykum! saytga yangilik qo'shish CreateView darsida yangilikni saqlamasligi nimadan bo'lishi mumkin",
      "Assalomu alaykum mentor va o'quvchilar. Bootstrap darslarini GUTTERS qismiga keldim. Ustoz videoda tushuntirganlarida faqat yangi sahifada kodlarni ko'rsatgani uchun ustozda bu holat kuzatilmagandi, men bu containerdan oldin 4xbr tashlab keyin yozganimda va GY-5 berganimda tepadaham yashil joy tashlandi, kim tushuntirib bera oladi,nimaga unday?",
      "lar hali javob bermadi, yordam bervoringlar",
      "Assalomu alaykum men javascript modulini 10kun oldin tugatdim Lekin hozir ubu loyiha qlaman desam esimda hech qaysi code yoq va method lar ham shunga nima qilishni tavsiya berasiz?",
      "yordam bervoring",
      "Men django kursini boshlagandim. Lekin shu xatolar yuzidan davom qila olmayapman. Birinchidan Run qilsam ishlamayapdi. Mana shunday qizil rangda demak xato bor o'qishida. ikkinchidan SQLite3 ni o'qimayapdi. Men birinchi marotaba Pycharmda ishlashim. qayeridadir Xato qilayapmanmi?",
      "anydisk orqalik krib yordam bervoring CSS | 42. RWD yordamida loyihani yaxshilash (1-qism) shundan o'tolmayapman",
      "Assalawma aleykum Python amaliy vazifa da username generator qiliwshi funkciya islewde paydalaniwshi atin listke otkerip awdara almay atirman. str (bir sozdi) di listke qanday metod bn otkeremiz? split() benen bolmay atir",
      "Assalomu alaykum html da web saytga rasm yuklayotganda rasm hajmini qanday qilib kichikroq qilsa bo'ladi juda katta bo'lib ketyapti qanday qilib ihchamroq qilsa bo'ladi",
      "Assalawma aleykum Fayl ishindegi kerekli abzatsdi tawip console ga qalay shigarsaq boladi? Misali txt fayli ishinen #6 abzatsin console ga shigariw kerek",
      "Assalomu alaykum HTML dan Job Application vazifasini bajarib yuklagandim Qachon tekshirib javobi aytiladi?",
      "Assalomu alaykum hammaga dasturlashda ishlatiladigan teglar va atributelarni qanday holda òrgangan maqul ròyxat qilib òrganishmi yoki tushunib ketishmi qaysi biri effectliroq qaysini birini maslahat beraszlar",
      "Vazifa bajarganimdan so'ng ustozdan javob deyilgan Lekin fikr bildirilmagan Nega bunday?",
      "Assalom aleykum xatolikni bartaraf etib bo'lmayabdi. yordamilar kerak",
      "Oila qatorini 5 ta ustunga ham umumiy qilishga yordam berib yuboring",
      "Assalawma aleykum class ishindegi funkciya ozgeriwshin sol class ishindegi basqa funkciyada qalay paydalansaq boladi?",
      "kimdir yordam beradimi.",
      "VSCode ga Live serverni o'rnatib Go Live tugmasini bossam shu chiqyabdi",
      "Assalomu alaykum. HTML kursidagi Job Application yaratishni VS Code orqali qilib keyin fileni yuklasak ham bo'ladi. Chunki vazifani bajarish uchun kod yozgani joy chiqarib ham berdi lekin unga tushunmadm shunga VS Code orqali qilsam bo'ladimi",
      "Assalomu alaykum. HTML kursini amaliy topshiriĝini yuklagandim, qancha vaqtda javob beriladi",
      "assalomu alaykum men authentificatsiya qilyotgandim unda user ro'yxatdan o'tishda code bilan emailini tasdiqlashi kerak bo'ladi shu holatda birdan ro'yxatdan o'tganda code jo'natish mobaynida o'zi user bazaga saqlanib bo'ladi keyin kode kiritib biror status berib u statusga tekshirish mumkin lekin agar user ro'yxatdan o'tish mobaynida kodeni kiritmay chiqib ketsa, keyinroq qaytadan ro'yxatdan o'tolmay qoladi yani email bazada bor bo'lgani uchun ro'yxatdan o'tolmaydi kode tasdiqlamagani uchun kirolmaydi ham qayta ro'yxatdan o'tolmayapti ham shu joyida nima qilish mumkin",
      "Assalom alaykum. Pythonda OOP uchun vazifani yuborishdagi farmat bòyicha muammo bòlyapti. Zip qilib tashlay olmayapman",
      "paroʻlni oʻzgartirgandim shunaqa chiqib beryapti shunga yordam berilar",
      "Bunaqa qismi yoq edi vazifada shunga tushunmadim",
      "Assalomu alaykum Men notebookimdan vs codega kirolmayabman maslahat bervoriylar. Chromeni oʻrnatdim lekin kod yozadigan joyini qayerdan ochishni bilmayabman",
      "Nega bunday boʻlyapti qanday toʻgʻirlasam boʻladi",
      "Assalomu alaykum . Bu yerda qanday xatolik bor rasm nega ochmayapti",
      "faqat shu bolim ishlamayabdi",
      "Assalomu alaykum fastapida loiha qilaylik anchadan beri chat bolmayapti",
      "main-section__title bilan <p> tegini orasidagi bo'sh joyni qisqartirib bo'lmayapti.",
      "testda to'g'ri javobni noto'g'ri ko'rsatyapti",
      "HTMLda Job Applicotion yasash joyiga yetib keldim u boshqichda nima qilish kerak uncha tushunmayapman",
      "yordam berib yuboring",
      "Assalawma aleykum Saytqa magluwmatlar bazasindagi janaliqlar qosilmay atir. Sabaqta kodlardi qayerden alsaq boladi? Salistirip qateni izlep koriw ushin",
      "kimdir javob beradmi",
      "Blog qismi sheriklarim qismi bunaqa bolib qoldi",
      "Assalawma aleykum Mentorlar qarap jiberin",
      "assalom alaykum OOP da yuborilgan vazifamni tekshirib bersangiz",
      "Assalomu alaykum Oxirgi darslarga kelgandim va tillarni o'zgartirish xususiyatini kiritdim. Lekin tilni o'zgartirganimda shu yerdagi content ko'rinmay qolayapti",
      "Assalomu alaykum. Shunga qarab yuboring xatolik berayapti",
      "Assalawma aleykum Sayt toliq juklenbey atir. Sebebi ne boliwi mumkin?",
      "home.html faylga janaliqlardi qosqan son janaliqlar shiqpay qaldi Slider joq bolip qaldi. Ne sebep boliwi mumkin?",
      "savoll",
      "savol cssda shularni qoshib bomebdi css, images,index.html nimaga?",
      "{% for news in news_list %} Usi blockti jazsan janaliqlardi magliwmatlar bazasinan alalmaydi, error da bermeydi 3 kunnen berli usinin sheshimin tabalmay atirman Magliwmatlar bazasinan almay tursa qaysi fayllarda qate boladi?",
      "Assalomu alaykum css bolimni ytugatib loyihani ham tugangan edim 5 mbdan oshib ketti shu yerga jonatsam boladi",
      "Menda ham shunday xatolik bo'layapti. Imglarni ko'rsatmayapti.",
      ", ,",
      "cssni amaliy vazifasini topshirganlar bo'lsa yordam qilib yuborsangizlar yaxshi bo'lardi. O'rniga men ham bilganlarim bo'yicha yordam qilishim mumkin. Telegram Bot tayyorlash masalasida)) quyidagi havolada hmtl va css kodlar bor. display inline block qilsam ham yonma yon tushmayapti. flex ishlatsam matnlar o'rtaga tushib qolyapti.",
      "ko'k backround qoydim, to'lqinsimon fonni urlda ko'rsattim negadir chiqmadi,va anau binoni rasmini kichraytirsam ko'k fon ham kichrayib ketyabdi",
      "Agar savolingizni mentorga yubormoqchi bo'lsangiz hashtagidan foydalanasiz",
      "Assalomu alaykum menda mana shuni hech bajara olmayapman anchadan beri o'zgarmaydi shuni qanday to'g'irlasa bo'ladi yordam bering",
      "shuni pastki qismini ham qanday to'lqinsimon va xira qilsa bo'ladi?",
      "shu nima bn yozilgan <ul> <li> bilanmi, yonidagi raqamga qanday alohida still berilgan",
      "1.vscodeda live serverni yoqsam go live degan yozuv chiqmayapti. 2 vs codeda papka yarata olmayapman",
      "vazifani zip faylini yuklab bo'lmayapti. github repo linki qayerga qo'yiladi?",
      "Assalomu alaykum! Vazifani saytga yuklolmadim. zip shaklda hajmi katta bo'lib ketdi, 7z ga o'tkazib yuborsam ketmayapti. github linkni paste qilib jo'natishni bossam ham baribir ketmayapti",
      "Assalawma aleykum Kommentariya jazip jiberiw knopkasin bassam usinday qate korsetip tur. Ozim izlep taba almadim, ne sebep boliwi mumkin?",
      "Assalawma aleykum gettext di download ettim, oni qalay ornatamiz?",
      ", Assalomu aleyküm oka brew ni o'rnatish videosini tashlab qo'ying iltimos",
      "Qarelar Katakni tagida so'zlar bor usha so'zlarni bilan katak qanaqa codda birga turibdi men chiqarolmadim",
      "live server ishlamayapti. nimadan bo’ladi bu?",
      "assalomu alaykum menda shunaqa muammo bo'layapti, consoleda 'null' chiqib qolayapti nima qilsa bo'ladi?",
      "shu qanday qilinardi",
      "trelloda boardni ichida bir nechta listlar joylashgan ekan shu sababdan shu holatda yuklagandim, aksincha bolishi keremidi? mentor javobini shu joyiga tushunmadim batafsilroq aytib berolasmi?",
      "qanday to'g'irlasa boladi",
      "assalomu alaykum! sqlni ishga tushirish uchun nima qilish kerak",
      ".Axir HTML kursida ushbu Job Applicationni namunadagidek yaratish tartibi o'rgatilmadiku. Chunki bu yerda umuman boshqacha metodlar qo'llangan. Guruhda yangi o'rganayotgan a'zolarda ham shunday bo'lyaptimi",
      "oradagi masofa judaa jozilib ketyapdi nima qilsam boladi ?",
      "frondend boʻyicha ulugʻbek samigjonov darslari yetarli qoʻshimcha malumot izlash shart emasmi. Asosan backend dasturlashga qiziqaman",
      "frondend boʻyicha ulugʻbek samigjonov darslari yetarlimi qoʻshimcha malumot izlash shart emasmi. Asosan backend dasturlashga qiziqaman. Python sql bilaman. Html css boshlanlich bilaman",
      "shu kod ishlamayabdi console da raqamni orniga \" ${number} is even\" shu chiqyabdi qanaqadur xato bormi",
      "Assalomu aleykum shu pastidagi kichik yozuvni qanday qilib kodlasa bo'ladi?",
      "Assalomu alaykum! Bootstrap darslari oxiridagi Loyiha uchun ko'rsatilgan sayt ochilmayapti. Shuni qanday topsa bo'ladi? shu saytga qarab qilamiz deb darsda aytilgan lekin sayt ochilmayapti.",
      "assalomu alaykum men swaggerda documentatsiya taxlagandim lekin basic Authorization ko'rsatayapti men esa token bilan login qiladigan qilib API chiqargandim shuni qanday qilib swaggerda Token bilan login qiladigan qila olaman",
      "Ас-саляму ‘аляйкум ва рахмату-Ллахи ва баракяту ман жаваскриптни тугатдим ва ушандаги амалий машгулотни саволигахам узигахам умуман тушунмадим иложиси буса уша машгулотни тушунтириб беролисизми????",
      "vaqtingiz bo‘lganida yordam berib yuboring consolda ‘null‘ chiqayabdi",
      "omborxona mock testida yordamingiz kerak. requestda 1 ta product code va quantity yuboriladi, lekin responseda 2ta product uchun ma'lumot kelyapti. Shu yeriga tushuntirish bering",
      "Kimdir javob beradimi?",
      "Ас-саляму ‘аляйкум ва рахмату-Ллахи ва баракяту жаваскриптни топширишиги текшириб беринг илтимос",
      "bu codeda start bosilganda raqam yuryapti stop bosilganda to’xtayapti. lekin start ikki marta bosilganda stop qilsa ham tuxtamay qolyapti qanaqa yechim qilsa bo’ladi",
      "Accordion ishladi,js ulamagan ekanman shuki accordion ochilyapti lekin yopilmayapti, 1 ni ochib 2 ni ochsa 1 yopilyapti lekin ohirida 1 tasi ochiq qob ketyaptida baribir",
      "Assalomu Alaykum html vazifasi uchun testda Birt Date bo'limida Select orqali yozib option valuelariga oylarni yozib chiqsam bo'ladi. Ammo kun yoki yillarga kelganda misol yil uchun 100 ta options yozishga to'g'ri kelarkan. Shu yeriga yordam bervorin nima qilsam bo'ladi.",
      "assalom aleykum quyidagilar korinmay qoldi sababini topa olmayabman, fronted qismidan emas lekin",
      "???",
      "topshiriqda nimani so'raganiga tushunmadim",
      "Assalawma aleykum Mock Task tapsirmani orinlawda logikasin jaziwga qiynalip atirman. Jol joba aytsaniz Jardem berealasizba?",
      "Amaliy loyihani Animatsiyasi css orqali qilish mumkinmi? Animatsiya lari orqali topshirish kk mi",
      "Assalomu alaykum. Menda mohirdev App bilan bogʻlanishda muammo boʻlyapti. Yordam bera olasizlarmi",
      "Assalomu alaykum vazifasini tugata olmayapman Faylni yuklamayapti ... — bunga tushunmadim Iltimos, yordam bersangiz P.S. » .html faylni o'zini ham , .zip faylni ham yuklab ko'rdim Uzoq vaqt \"yuklanmoqda\" yozuvi chiqib turaveryapti",
      "Assalomu alaykum vazifasini tugata olmayapman Faylni yuklamayapti ... — bunga tushunmadim Iltimos, yordam bersangiz P.S. » .html faylni o'zini ham , .zip faylni ham yuklab ko'rdim Uzoq vaqt \"yuklanmoqda\" yozuvi chiqib turaveryapti",
      "Assalom alaykum divni ichidagi p tagi ishlamayapti",
      "git hub da account ochdim> repository ochib, faylni yukladim> linkni olib kod yozadigan joyga joyladim !! Faqat fayl yuklash majburiy degan yozuv chiqaveryapti",
      "Assalomu alaykum Hali ham shu holatda turibdi Iltimos, amaliy yordam beringlar",
      "qanday qilib zip fayl qiladi o'rgatvorilar",
      "Assalomu alaykum. Postga aloqador kommentlarni ko'rish imkoni yo'q deb javob berilgan. Lekin kommentlarni chiqaradigan kod yozganman va ishlayaptiku.",
      "Assalomu alaykum \"ko'chirilgan\" bunda nimani nazarda tutilgan ? > kod qismlarini internetdan (w3schools masalan) ko'rib, undan foydalish mumkinmi ?",
      "модулдаги видеолар ютубда бор экан ку нимага пул толадик?",
      "Assalomu Alaykum sql ga boshqa database ni qanday ulasam boladi error bervotti terminalda",
      "Assalomu alykum men windows powershellni sozlayolmayapman shunga yordam bering, imkon bo'lsa anydesk orqali kirib sozlab bersangiz yaxshi bo'lardi.",
      "ahost dan hosting olib ishlatayotgandim lekin 2 kundan keyin ishlamay qoldi shu nimadan bo'lsihi mumkin qanday to'g'irlayamn",
      "shunday muammo bor nima qilsa bo'ladi",
      "Assalomu alaykum, Savolim kursni yanada ko'proq o'rganish uchun va ko'proq nimalarga ahamiyat berish kerak darslardan tashqari nimalar qilsa bo'ladi?",
      "Assalomu alaykum, Savolim kursni yanada ko'proq o'rganish uchun va ko'proq nimalarga ahamiyat berish kerak darslardan tashqari nimalar qilsa bo'ladi?",
      "Assalomu alaykum, image - ni qanday qilib rotate qilish mumkin 360* ga?",
      "Assalomu alekum. Saytda about-me sectionda rasm bilan info divi ustma-ust tushib qovotti, .about-me__image classiga stil bersam ishlamayapti. Qayoda xato qivomman?",
      "Assalomu alaykum, css - da \" manashu belgini bitaligini qanday qo'ysa bo'ladi?",
      "Assalawma aleykum Mock Task tapsirmasinda response da tek bir dictionary bolip shigip atir partiya boyinsha warehouse id si material price si shiqpay tur. Kod ti korip, duzetiw kerek jerlerdi korsetip bere alasizba?",
      "Assalomu alaykum bu safargi meetni Djangoni asyncron ishlatish haqida qiling iloji bo'lsa men qidirib ko'rdim lekin sal chalkash bo'lyapti qaysini qayerda qo'llasam yaxshiroq natijaga erishaman qaysini qayerda qo'llab bo'lmasligini yaxshi tushunolmayapman",
      "Assalomu alaykum img tegini togri qollasam ham sahifada rasm chiqmayapti negadur",
      "savol qayerda xatolik buldi jadvalda 2 chi qatorni chiziqlar orasiga ololmadim",
      "Assalomu alaykum, menda nima xatolik bor ko'k overlay scroll qilganda headerni ustiga chiqib ketyabdi",
      "yordam berib yuboring iltimos",
      "tavakkal bittasini bosyapman) xatolik bo'lsa balini ko'paytirib qo'yasizlarmi?)",
      "Assalomu alaykum! OOP uchun vazifadagi ushbu faylni oddiy .py faylga dict qilib saqlab olib ishlatsak bo'ladimi? Yoki shu txt shaklida foydalanish kerakmi?",
      "Manashu erda nima xato borligini tushuntira olasilami, left va right tomonlarga padding beryapman, ammo brauzerda bir biridan ajralmayapti",
      "Manashu erda nima xato borligini tushuntira olasilami, left va right tomonlarga padding beryapman, ammo brauzerda bir biridan ajralmayapti",
      "men django projectimni dockerga o'tkazgandim o'zimda celery bilan emailga xabar jo'natish ishlayotgandi dockerga o'tkazganimdan keyin ishlamay qoldi pastga docker filelarimni codini tashlab qo'yaman shuni ko'rib beraolasizmi nimadan bo'layotganini bilolmayapman hech bir xato chiqmayapti",
      "mana shu yerdagi command qismi negadir ishga tushmayapti ekan bitta bitta terminaliga kirib ishlatib ko'rdim ishlayapti lekin automatik celeryni workerini ishga tushurmayapti ekan negadir nima qilsam bo'ladi shuni ni ichiga shuni run qilib yuborsam bo'ladimi",
      "mana shuni nima qilsam bo'ladi shunga yordam berib yuboring men hamma joydan qidirib ko'rdim lekin hech qaysi holatda ishlamayapti",
      "Asssalomu aleykum Hammaga,Iltimos yordam berib yuboringlar. Shu rasmda belgilangan joylar, Ctrl ni bosib sichqonchani o'rtasi buralganda yo kattalashib yo kichiklashib ketyabdi. Rasm esa deyarli har doim bir hil hajimda qolyabdi.",
      "men railwayga dockerize qilingan django projectimni deploy qilmoqchiman lekin railway Dockerfile ishga tushuryaptida docker-compose fileni ishga tushurmayapti shuning uchunmi 502 gateway berib qolyapti deploy qilganidan keyin shuni qanday qilib docker-composeni run qiladigan qilishim mumkin",
      "iltimos javob berib yuboring",
      "Assalomu alaykum HTML da Job application loyihani yuklagandim tekshirib bering !",
      "Assalomu aleykum men Html darslarida VS code orqali kod yozganimda va google chromeda ochganimda Desktopda shunday qizil X bulib qolayapti shularni qanday togirlasam buladi Oldindan rahmat",
      "Assalomu aleykum men Html darslarida VS code orqali kod yozganimda va google chromeda ochganimda Desktopda shunday qizil X bulib qolayapti shularni qanday togirlasam buladi Oldindan rahmat",
      "men python telegram bot yasagan edim u ni 1 funkisyasi ishlamayapti iloji bolsa shaxsiydan yordam bera olasizmi !!",
      "Assalomu alaykum! Menda shu qismida darsda ko'rsatilganidek Templates Folder degan joyi chiqmayapti. GPTdan so'rab ko'rdim baribir xatoni topolmadim",
      "Assalomu aleykum postgrsqlni qayerdan skachat qilish mumkin, saytdan qanday skachat qilishni bilmayapman",
      "Assalomu aleykum youtubdan copy qilgan video browserda ochmayapti nima qilsam boladi? Oldindan rahmat",
      "KAtta rahmat. MEnda yana 2 ta savol paydo bo'ldi. Iltimos, shularga ham javob yozsangiz. 1. Fast API bilan katta loyihalar qilsa ham bo'ladimi? Misol uchun instagram, facebook yoki youtube ga o'xshagan katta loyihalarning backendini ham yozsa bo'ladimi? 2. Shu FastAPI uchun front-end qismini yzoishda Qaysi framework yaxshi? Misol uchun, VUE, React yoki Angular?",
      "Assalomu alaykum fastapida bir papkani ichidagi filedan turib boshqa shu papka bilan bir rootda turgan papka ichidagi fileni ichidagi functionni qanday qilib chaqirib olishim mumkin. chaqirmoqchi bo'lsam ModuleNotFoundError beryapti",
      "assalomu alaykum ustoz heroku da reg qilmoqchi edim lekin gmail ga link kelmayapti",
      "manashu qanday qilinadi",
      "Assalomu alaykum men alembicni sozladim migratsiya qilsam ishladi lekin alembic upgrade head shuni ishlatsam NameError: name 'sqlalchemy_utils' is not defined shunday xato beryapti buni qanday to'g'rilashim mumkin",
      "Assalomu alaykum ustoz, dasturimni database bilan darsda ko'rsatilgan ketma ketlikda connect qildim lekin malumot qo'shmoqchi bolsam ushbu xatoni chiqarmoqda",
      "Assalomu alykum actionga contact viewga url bersam ham shu xatolikni qaytaryapti qanday to'g'rilash mumkin",
      "nega bunday bo'lyapti",
      "vaqtingiz bormi bir korib bering please",
      "Assalomu alaykum. MEn FastApi darsida JWT tojen bilan ishlash darsiga yetib kelib videoda qanday tushuntirilgan bo'lsa huddi shunday hammasini bajardim. Ammo shu xatolik qayta-qayta chiqyapti. Iltimos, shunga nima qilishimni aytsangiz. Youtube va google dan ham buning yechimini topa olmadim.👇",
      "assalomu alaykum",
      "UStoz kun bo'yi javobingizni kutdim. Ammo javob bermadingiz.",
      "men django projectimni deploy qilish uchun sozlab deploy qildim endi localimda ishlataman desam ochmayapti buni qanday to'g'rilashim mumkin",
      "Assalom alaykum. flex box elementlarni ikki uch qatorli yoki ustunli qlimoqchi edim. lekin o'xshamaypti? qanday amalga oshirsam bo'ladi",
      "nimaga bunaqa bolib turibdi",
      "Assalomu alaykum fastapi loyihasini run qilganda rasmdagi kabi muammo bo'layapti",
      "Salom alleykum, shu siznink noutbukingizdagi polignlar borku, rasmda ko'rsatilgan, o'shalarni biz qaerdan olsak bi'ladi",
      "Assalomu Allayukum, modulni oxiridigi vazifani topshirgan edim 3 kundan oshdi sal kam 1 haftda bovotti qachon tekshirib javobi etilai?",
      "Assalomu Alaykum, manda sql shunaqa bob qovotti nima qilsam boladi ?",
      "Assalomu alaykum! Shunda truncatewords ishlamayapti, xatolikni topolmayapman.",
      "nima qilish kerak ustoz yozgan narsa umman chiqmayaptiku",
      "Assalomu alekum. Button uchun transition xossasi ishlamayapti lekin menyu uchun ishlavotti. Qayoda xato qivomman?",
      "mana shunda yordamlashib yuboring",
      "CSSdagi Amaliy loyiha strukturasi qanaqa boʻladi yaʼni nomlari va ketma-ketligi",
      "Assalomu Alaykum vazifani tekshirib beroliszmi?",
      "Iltimos aytib yuboring",
      "OOP bo'limi uchun vazifani yuborishga yordam berib yuboringlar",
      "Assalomu alleykum, nega display:flex berganda mendagi statics va service qismlari blocka o'tib qolyapti, justifity ham berdim, wrap ni row qilip ham ko'ryapman bo'lmayapti",
      "assalomu alaykum django drfda view yozyotganda avval django modeldan datalarni olib olib keyin serializer classga berib yuboramizku shunda serializer class faqatgina shu biz olib kelgan datani ichidan oʻzini ichida bor fieldlarni qiymatlarini olib qolganini shunchaki tashlab yuboradimi yoki oʻzi yangittan DB ga soʻrov yuboradimi shu boʻyicha toʻliqroq yozib tushuntirib yuborolasizmi",
      "salom hammaga namunada kursatilgandek first name larni ramkani pastidan chiqarish uchun nima qilish kerak",
      "bu savolga ham javob berib yuboring",
      "bazaga execute qilganda shunaqa oshibka berayapti",
      "breakpointslar chiqmayapti.lyuboy widthdaham bir hil ko'rinishga ega bo'lib qolyapti",
      "tushunmadiz shekili yoki men javobingizni tushunmadim. men endi responsive qilmoqchi edim lekin 42 videodarslikda hali media bermasaham harhil qurilmalarga moslasa o'zgarish bo'layotgan edi (masalan 768pxdan kam holatda breedning rasmi ko'rinmayotgan edi) menda esa unday bo'lmayapti",
      "Assalomunalleykum, menda suratda ko'rsatganimdek, info dagi matnlar orasida masofa ko'payib ketyapti, ma ularga padding yo margin bergan yo'qman, o'shalarni bir biriga qarinroq qilish uchu nima qilish kerak",
      "Shuni tepaga o'tkazish ucun qanaqa xossadan foydalanish kerak",
      "Assalomu Alaykum blog loyihasi views va templates lar bn ishlash darsida berilgan {%extends “base.html” %} code ishlamayapti nimadan bolishi mumkun?",
      "asslom alaykum! orasidagi masofa özgarmayapti",
      "Assalawma aleykum Saytti ahost ga ornatip, saytqa kirsem usinday qate shigarip tur. Buni qalay tuwirlaymiz?",
      "Assalom aleykum HEMIS Oauth, DRF, Vue da project qilmoqchi edim ularni qanday bir biriga bog'lashni tushunmayabman yordam bering.",
      "Assalomu aleykum! Tushunmayotgan joyim bor edi. O'rgatib yuborsangiz mamnun bo'lardim. Savol: Navbar qismi va main qismini bir xil \".container\" wrapper class bilan qolipga solmoqchi edim, ya'ni max-width: 1400px qilib, hamma jarayon shuning ichiga tushurmoqchi edim. Lekin layout buzilyapti: 1) navbar box.ning 1400px kengligidan tashqarida ham soya hosil qilish kabi hodisa chiqishi; 2) Application kengligi device viewport kengligidan oshib ketib pastda gorizontal scrollbar hosil bo'lishi va responsive xususiyatning buzilishi (navbar menularning o'ng qismi o'ng tomonga yig'ilib kirib ketishi). Yuqoridagi 2 muammolarning sababi nima va qanday yechim topsam bo'ladi? Rahmat!",
      "Assalomu aleykum! Tushunmayotgan joyim bor edi. O'rgatib yuborsangiz mamnun bo'lardim. Savol: Navbar qismi va main qismini bir xil \".container\" wrapper class bilan qolipga solmoqchi edim, ya'ni max-width: 1400px qilib, hamma jarayon shuning ichiga tushurmoqchi edim. Lekin layout buzilyapti: 1) navbar box.ning 1400px kengligidan tashqarida ham soya hosil qilish kabi hodisa chiqishi; 2) Application kengligi device viewport kengligidan oshib ketib pastda gorizontal scrollbar hosil bo'lishi va responsive xususiyatning buzilishi (navbar menularning o'ng qismi o'ng tomonga yig'ilib kirib ketishi). Yuqoridagi 2 muammolarning sababi nima va qanday yechim topsam bo'ladi? Rahmat!",
      "Assalomu alaykum kurs loyihasida elementlarni joylashtirishda muammoga duch kelyapman. Coddlarni koʻrib bersela xursand boʻlardim, qayerda xato qilyapman html qismida elementlarni joylashuvidami yoki CSS qismida notoʻgʻri berilgan qiymatdami",
      "databaseni connect qilsam shunaqa error chiqyapti .env file ni ishlatmasdan shunde yozib connect qilsam ulanyapti .env ga malumotlarni kochirsam shunaqa error qaytaryapti. decoupe kutubxonasini ornatganman",
      "Assalom alaykum. 1.navbar qismi ekran kattalashganda örtada emas chapga surilib ketyapti. 2about me qismidagi rasm va matn qöshilib ketyapti shunga yordam bering",
      "nega bunda Russian_Kazakhsatn bob turibdi",
      "Assalomu Alaykum tayyor database bn ishlamoqchi edim uni qanday qilib pgAdmin dan import qsam boladi yani table va ichidigi ma’lumotlani?",
      "Xatolik. DataBaselar yaratib bolyaptiku, lekin serverga videodaqa ulamaganman, host kiritib",
      "Ha kuchli parol hammasini to'g'riladim iltimos yordam qilib yuboring.",
      "Assalomu alaykum djangoda jwt tokendan foydalanib login logoutni yaratganda access tokenni ham refresh tokenni ham blacklistlarini ham o'zi yaratardi fastapida ham shunday qiladigan paketlar bormi yoki o'zimiz qo'lda access va refresh tokenlarni yaratishimiz blacklistni ham o'zimiz bazada tokenga status qo'shib yoki bazadan shu tokenni o'chirib yuboradigan qilib yozishimiz kerakmi",
      "Assalomu alaykum . Nimaga bunda extends base.html qisam ishlamayapti .(xatolik pasda ) Keyin bu shablonimda kodlarni yossam rangi boshqacha bo'mayapti nargi shablonimda ranglari boshqacha edi i yordam berib turardi oxirini tugatishda .",
      "Assalomu alaykum savolim bor edi.. Job application form yasayotganda huddi shu web sahifada qilingandak yaratish kerakmi ya’ni joylashgan joylarini nazarda tutyapman, menda yonma-yon emas pastdan boshlanyapti….",
      "faylida emailni consol ga yuborish qilsam consolga hechqanday xabar kelmayapti nima qilish mumkin.",
      "Assalom alaykum hammaga OOP bo'yicha vazifani bajardim. Kod ishlayapti ma'lumotlar tóliq chiqyapti. Lekin kodni yuborsam har safar ustozdan, tóliq ta'rifni chiqarish kerak degan Javob kelyapti. Shu vazifani tekshirib beradiganlar bormi. Yordam qilinglar bir",
      "Assalom alaykum css kursi loyihasidagi background imageni qayerdan olsam böladi",
      "Assalomu alaykum , nimaga rasm yuklanmayapti ?",
      "nimaga rasm yuklanmayapti get so'rovi bilan murojat qib rasmni ololmayapti .",
      "Assalomu aleykum Live serverni ornatmoqcho bolsam shunaqa deyapti nma qilsam boladi",
      "mana mendagi natija",
      "Assalom alaykum. job applicationdagi inputlarni va ular tagidagi yozuvni qanday chiqarsa böladi?",
      "assalomu alaykum base.html fayliga yozilgan social areada rasmi chiqmayapti . tayyor shablonni olgandim backendga o'girganda shunaqa bo'p qoldi .",
      "bizga homworklar ham beriladimi video dars davomida",
      "Ha, input va label bilan yasyapman, lekin aynan shunday koʻrinishda qilolmayapman. First Nameʼlarni har bir ramka tagiga tushirib. Shunga yordam berib yuboringlar, iltimos",
      "Assalomu aleykum savollarim bor edi. 1) Hozirda Django asoslari(Arxiv) darslarini ko'ryapman. Bu bo'limdan keyin Django asoslari(Yangi) bo'limini ko'rmasdan birdan Django Rest framework yoki FastAPI bo'limiga o'tib ketsa ham tushunarli bo'laveradimi? 2) FastAPI framework bilan Django Rest framework darsliklarini bog'liqlik joyi yo'qmi? Hozirda men ishlayotgan kompaniyada loyihani FastAPI da ko'tarilishi kerakligi uchun tezroq o'rganish maqsadida dastlab FastAPI darslarini ko'rsa ham bo'ladimi?",
      "Kimdir menga topshiriqni tushuntirib bervorsin, iltimos",
      "tilni o'zgartirganda hech narsa chiqmayapti xatolik ham chiqmayapti, nimadan bo'lishi mumkin",
      "Qande qilib 3 ta bo'sh katakni ya'ni ism familiyasi va sharif yozish uchun mavjud boʻlgan 3 ta bo'sh joyni bir qatorda qilib va ularning ostiga matn joylashtira olamiz bu haqida darsda hech narsa oʻtilmagan ekan men html modulini tugatdim lekin bu haqida hech narsa deyilmagan lekin job application uchun mana shunday amaliyot qoʻshilgan bu xato masmi sila oʻtmagansila ammo amaliyot uchun vazifa bergansila qanday qilib oʻrganmagan narsamni men amaliyotda bajarishim kerak bu degani men internetdan foydalanaman chat gpt shu kabi sunʼiy intellektlardan, bu menga foyda bermidi faqatgina meni ziyonimga ishlidi hech bomaganda qisqa qib boʻsayam o'rgatsela boʻlardi!",
      "Shu qanaq qilib yasaladi?",
      "Assalomu alaykum yaxshimisizlar Men kursni oʻrganishni 4 oyidaman oxirgi paytlarda dangasalik zerikish tufayli darslarni reja qilganimdan oʻtkazib yuboryapman. Sizlarda ham shunday holat bolgan bolsa nima tavsiya berasizlar",
      "Mana shuni qande qiladi other ustiga bosganda matn kiritish uchun joy chiqishi kere, tepadegilarini radio tegi bilan qildim",
      "assalomu alaykum . Nimaga githubega yuklab bo'mayapti ? qayta qayta login parol bilan kirishga urinib ko'rdim githube desktopda . Saytda kiryapti lekin .",
      "Assalom alaykum. Python Asoslari va OOP uchun vazifalarni yuborgan edim. Tekshirib berasizmi",
      "salom sql ni sozlashda shunaqa muammo chiqayapti nimadan bo'ladi bu?",
      "html bo'yicha mustaqil bajarishim uchun topshiriqlarni qande qilib qayerdan olsam buladi",
      "assalomu alaykum . men slugni kattaroq oluvdim shunga url sifatida ishlatib bo'lmaydi dedi . Darsda url sifatida slug olinga. Men slug emas title qilib ishlatdim . Lekin undan keyin /edit/ qo'shdim ishlamadi . Nima qilsam bo'ladi . rasmlarda view url model berilgan .",
      "postmanga urlni tashlasam hech nima chiqarmayapti ? qandedir sozlamasi bormi?",
      "Assalomu alaykum. Dars davomida spider ilovasida kod yozgan Shuni vs code da yozishni aytmagan nimaga",
      "html buyicha mustaqil bajarishim uchun topshiriqlarni internetdan topolmayomman shu buyicha qanaqadur sayt bulsa linkini tashlab berolasizmi",
      "assalomu alaykum video darsda get_queryset va get_object funksiyalari yozilmagan . Videoda ishlayapti . Lekin men yozgan kodda ishlamadi keyin chatgptdan so'rasam shuni ishlatish kerak dedi keyin ishladi ? nima sababdan bunaqa bo'ldi ?",
      "nimaga create url ishlamayapti 404 beryapti",
      "assalomu alaykum . funksiyada yozilgan viewni classda yozilgan viewga alamshtirayotgandilar video darsda. Oldin yozilganida if va else tugagandan keyin return yozilyapti (ya'ni post requestda ham get requestda ham ishlaydigan ) classda yozilgan viewda esa bu qop kettimi ? Faqat get uchun return qo'ydilar .post uchun o'zim qo'yib qo'ydim . To'grimi shu ?",
      "Email kiritganda NumberParseException xatoligi chiqyapti. qanday to'grilasam bo'ladi?",
      "Assalomu alaykum. Men darsliklarni endi boshlayotgan edim. Kompyuterimda bloknot yuq ekan. Yuklashga harakat qildim iloji bo‘lmadi. Notpadda ham ishlasa bo‘ladimi",
      "Assalomu alaykum vs code yuklagan edim login surayapti nima qilishim kerak bu yerrda",
      "Assalomu alaykum vs code yuklagan edim login surayapti nima qilishim kerak bu yerrda",
      "Assalomu alaykum vs code yuklagan edim login surayapti nima qilishim kerak bu yerrda",
      "Assalomu alaykum. Live serverni yoqib veb serverni ikkalasini yonmayon qo'yolmayapman. Shuni tushuntiring. Iltimos.",
      "htmlga oid misollar kerak",
      "Boshqa screnshot ket8b qolibdi. Mana shundan keyin nima qilsam bo‘ladi? Yangi yuklangan vs code bu",
      "ishladi lekin rasmlani joylashuvini to'g'irlab bomayapti chap tomonda turgan rasmga qogan 2 ta rasm teng bolishi kereku 25-dars qaytadan yana korib chiqdim hamma kod nuqta verguligachan bir xill. rasmla joyloshuvi xato shuni korib berin yoki 3 yil oldibgi darslik boganinga hozir css yangilanib bu kodlani ichidan qaysidur birini qabul qimayotgandir",
      "#29-dars 1-rasmdagi ustoz qigan partners blogi. Videodagi men xuddi ustozi kodi bilan qigan meni partners blogim hamma narsa rasmla gruppadan olasiz deyilgan gruppasi qatta ungayam 3 yil bogan oʻlchovi har xill bogan rasmlani qanaqib qilamiz har doim bir xill rasm bomidiku 25-darsiyam 3 ta rasm bir biriga toʻgʻri qilomasdan 2 ta rasm qildim oʻrgatila shuni odami qiynavordi rasm qoʻyadigan joyi chiqsa kongil aynivoti uje, tolka bir xill hajmdagi rasm ishlatilgan har doim bir xill rasm bomidiku",
      "savol 👆",
      "Assalomu aleykum menda list chiqatish kerak operator_type modelga forien key qilingan, agar togridan name oladigan bolsam IO attempted hato chiqarayapti. bunda harbir operator uchun typeni request databasega boryapti shuni yaxshilasa boladmi",
      "Assalomu alekum men Mohirdevda IT ga ilk qadam kursi frontend bolimidagi 2chi darsda next.js ni terminalda ishlatolmayapman yordamlashib qoyila",
      ". . Assalomu alaykum. Haligi klaviatura dagi ʼʼ<> ʼʼ shu simvollarni shiftni ishlatmasdan toʻgʻridan toʻgʻri yozsa boʻlmaydimi ?!",
      "Assalomu alekum men Mohirdevda IT ga ilk qadam kursi frontend bolimidagi 2chi darsda next.js ni terminalda ishlatolmayapman yordamlashib qoyila",
      "Assalomu alekum men Mohirdevda IT ga ilk qadam kursi frontend bolimidagi 2chi darsda next.js ni terminalda ishlatolmayapman yordamlashib qoyila",
      "Assalomu alekum men Mohirdevda IT ga ilk qadam kursi frontend bolimidagi 2chi darsda next.js ni terminalda ishlatolmayapman yordamlashib qoyila",
      "assalom alaykum. Iltimos shu xatolik bo'yicha yordam berib yuboring. faqat home sahifasi ishlamayapti qolgan qismlari joyida",
      "Assalamu Alaykum Hammasi togri ishlayapti, lekin admin panelda rasmni ko'rsatmayapti ?",
      "topshiriq hali ham tekshirilmapti",
      "yordam berib yuboringszlar",
      "qanday hal qilsam boladi",
      "Trello loyihasining Ma’lumotlar bazasini shakllantirish wuni qanday qiladi chuntirvoring iltimos chunmadim",
      "lichkaga tashadim",
      "Bu yerda css file ni ulab bo'lmayapti xatolik qayerdaligi ayta olasizmi",
      "nega bunaqa devoti buu",
      "Nega vazifa baholanmayabdi",
      "Assalomu aleukum backend qaysi tilda kotarilgan asosiy qismi",
      "Meni kompyuterimda blaknot ichga buni yozdim lekin ustiga 2 marta ochsam hech qanday sayt ichga kirmayapti qanday qilsa boladi",
      "Assalomu alaykum nimaga front endni backendga ulasam shunaqa xatolik chiqib qoldi codeni copy paste qilib qo'ydim keyin rasm urlarni to'g'irlab chiqdim",
      "Asalom malekum windows da Sql faylni ustanofkada kod sorayapti qanday ustanofka qilinadi",
      "Assalomu aleykom yuqoridagi sariq fonni namunadagidek qila olmayapman. Kodda nima xato borligini aytib yuborilar",
      "Fonts modulida fastapi ni olamiz dedi lekin fastapi nmaligini tushuntirib ketmaganakan, nma u saytda boʻladigan narsami",
      "Assalomu alekum background image qoydim ishlamayapti orqa fonga rasm chiqmayapti xato qayerda ketgan",
      ". Assalom aleykum, mohirdevda akkauntni eski nomerimga ochganman, lekin u nomerni ishlatmayapman. Shunga akkauntni yangi nomerimga o'tkazib bilamanmi, kursni yo'qotmasdan.",
      "Asalomu aleykum mentor mana shunga yordam berib yuboreng shuncha chuqaladim topa olmadim",
      "men navbarga dropdown ko'rsatyapman, ammo dropdown tugmasi chiqganu, ustiga bossam ichidagi itemlar chiqmayapti, shuning sababini aytolasizmi?",
      "Assalawma aleykum Ibrat farzadlari loyihasi ilovasining Ibrat English bolimidagi har gal kirish dagi qadamlarni olib tashlash imkoni bormi har gal kirganda toldirish juda zerikarli va noqulay...",
      "Assalomu alaykum Payme integratsiya darsidagini business akkountsiz ham qo'llasa bo'ladimi pet projectlar uchun?",
      "Assalawma aleykum jardem bere alasizba? Jol joba korsetseniz",
      "Asosan web saytlarni har bir sahifasi alohida html file da yoziladi. Lekin katta saytlar Amazon kabi saytilards html file da saqlanmas ekan ular dinamik tarzda sahifalar avtamitik html backend tomonidan yozilar ekan shu narsaga unchalik tushunmadim shunda oldindan sahifalar backend orqali tayyorlab qoyiladimi",
      "Ассалому алейкум, html асосларини тугатган эдим, (job application file) ни юкладим, нечи кунда жавоби чикади?",
      "Nima sabab bo'lishi mumkin, xs-da birinchi element yo'qolmadi, hammasini ko'rsatgandegham qildim ammo bo'mayapti, shuni bir ko'rsezlar degandim",
      "Assalamu Alaykum admin panelga kirolmay qoldim nima qilsa boladi",
      "Assalomu alaykum, python asoslari bo'liminig oxiridagi topshiriqda textni .txt fayldan o'qib olish kerak ekan. Shunda with open(\"fayl.txt\", \"r\") qilib yozib ketsak bo'ldimi, yoki kodga qo'shib txt faylni ham jo'natish kerakmi, jo'natish kerak bo'lsa, txt faylni kod bilan qanday jo'nataman",
      "Ustoz, o'ta sekin tortyabdiku dasturini?",
      "Assalomu alleykum, men tepada suratlar bilan ham savol bergandim, endinqo'shimcha tarzda yana bir narsani so'ramoqchiman. Men nimagadur md va undan kichikroq breakpointlardan foydalansam, ekranimni responsiv qilib kichraytirsam o'zgarish bo'lmayabti, ammo lg yoki undan kattaroq breakpointlardan foidalansam kodim to'g'ri ishlayapti, bunda biron sabab bo'lishi mumkinmi?",
      "kimdur error qayerda ekanini bilsa yordam bervorsin pls",
      "Assalomu alaykum. - tayyor proyektlar degan guruh ham ochaylik.",
      "Assalom aleykum amaliy loyihaga 2 kun boʻldi hali tekshirilmadi",
      "HTML da job application ni javobi qachon chiqadi?",
      "Muammo nimadaligini tushuna olmayapman, html va bodyga hech qanaqa cheklov qoyilmagan lekin bu qismla regulirovkadigi olchamlaga to'g'ri kevotti. Navbarga hech qanaqa olcham berilmagan holatta width 100% korsatilganda shunaqa muammo bolishi mumkunmi, qanaqa qilib togirlasa boladi?",
      "Assalomu aleykom yuqoridagi sariq fonni namunadagidek qila olmayapman. Kodda nima xato borligini aytib yuborilar",
      "Halliham javob kutyabman, chunki birontasi o' xshamyabti manda?",
      "evil() funksiyasini tushuntirib bera olasizmi?",
      "Assalomu alaykum kim telegram mini app bilan yaxshi ishlay oladi, yordam kerak. Mini appni inline bot orqali tashash kerak va yana boshqa muammolar ham bor",
      "Assalomu alaykum bu safargi video chatda fastapida websocketda ishlash bo'yicha qila olasizmi. Iloji bo'lsa oddiy chat app bo'yicha tushuntirsangiz ham bo'lardi uni qanday ishlashi mantig'ini yaxshi tushunolmayapman. videodars qilib tashlasangiz ham farqi yo'q shu bo'yicha kichik kodda yozib mantig'ini qanday ishlashini tushuntirib bering",
      "bormi bu gruppada muaamoga yechim beradigan",
      "assalomu alaykum nimaga darsdagiday yossam xatolik berdi ? darsda ham xatolik bergan lekin email post qilganda auth_validate funksiyasida print yozgani uchun natija chiqqan edi",
      "Assalomu alaykum . Aka makemigrations migrate qilganda migratsiya fayllarini ichiga tushmayapti o'zgarishlar (oldingi o'zgarishlar turipti ) migratsiya qilishga o'zgarishlar yo'q deb chiqadiku o'sha natija chiqayapti .",
      "Assalomu alaykum menda bunaqa xatolik berayabdi nima qilsam bo'ladi",
      "Assalomu alaykum CSS oxiridagi loyihaning orqa fon rasmlarini topolmadim qayerdan olaman",
      "Vazifani yuklamoqchi edim hajmi 5 mb DAN koʻp yuklab boʻlmaydi degan xatolik chiqayabdi nima qilay endi",
      "Assalomu alaykum yaxshimisiz form.as_p oʻrniga oʻzimni css uslubimni qollasam ga Shuni qoshib qoyish kerakmi",
      "assalomu alaykum . nimada xatolik bo'lgan tokenni tanimayapti lekin modelda funksiyalar yozilgan",
      "Bu link da deyarli django ga bog'liq hech narsa topolmadim...",
      "Assalomu alaykum. Manda python asoslari kursini funksiya mavzusida tushunmivchiligim bor. Xullas funksiyani tushundim Lekin \"return\" operatorini qachon,qayerda va nima uchun ishlatilishini ummuman tushunmayabman. Darslikni qayta-qayta kordim va boshqa darsliklarni xam kordim afsuski tushuna olmayabman. Nima maslaxat berasiz.",
      "Assalomu alaykum . Bootstrapda breakpoint larga sal tushunmayapman. Container -{breakpoint} da ekran oʻlchamiga qarab 💯% ekran oʻlchami kattarsa max-width bölishi aytilgan .Ya'ni Container -sm qiymati ekran ölchami 768pxgacha boʻlsa bölsa width:100% bölishi undan ekran qiymati kattalashsa 720 px bölishi kerak. Lekin keyingi breakpoint nuqtadan oshsa ya'ni 992 pxdan 720 px bölishi kerak bölgan width 960 boʻlyapti. Shuni tushuntirib bera olasizmi",
      "Assalomu alaykum, Mirxojiddin! Guruhda mentor bilan bog‘lanish va savolingizga tezroq javob olish uchun tagidan foydalaning.",
      "ustoz yaxshimisiz. Sizni yordamiz menga hozir juda juda muhim. 1 ta saytda ma'lumot olishga yordamiz kerak. loyihamni hamma qismi tayyor shu qismini qilsam yakunlayman. yordam berolasizmi",
      "Assalomu aleykum xozir loiham bor edi uni ci cd qilmoqchi edi. Lekin docker composeda qanday qilib testlarimni teshkiraman. Shunga alohida compose file qilamanmi yoki qanaqa boladi",
      "Assalomu alekum. Amaliy loyihadegi saytni navigatsiya paneli uchun animatsiya qanaqa hosil qilinadi. Animatsiya - yurg'izganda ishlavotti. Bu funksiyani qaysidir selektor bilan qisa bo'ladimi (masalan :hover, :active ga o'xshagan)?",
      "Assalomu alaykum Hoz html kursini tugatgandagi job application topshirigʻini yuborgandim qanchadan beri ketmayapti nima qilsam boʻladi",
      "Assalamu alleykum kursga to'lovni qanday amalga oshirsam boladi?",
      "11 darsdagi vazifalarni xato joylagansizlar ekan qayerda togʻri varianti bor bu sizlarniki",
      "Assalomu alaykum Django va DRF orqali qanday qilib multiple file yuklaydigan api yozsa bo'ladi shuni tushuntirib yuboring djangodagi FileField multiple file qabul qilmas ekan",
      "shuni menga o'ratib yuboring",
      "Shu erlarda nima xatolik borki, tugma ishlamayapti?",
      "Html va CSS yordamida sayt kodini yoratdim lekin uni insonlar qidirganda chiqishi uchun qayerga joylashim kerak boladi",
      "Qaysi dars",
      "Biror video qoʻllanma bormi",
      "assalomu aleykum men bot yaratayotgan edim negadur botda tugma ishlamayapti yani javob qaytmayapti konsolda ham muammo yoq botda savol chiqadi va shu savol tagida katta va kichik degan tugma chiqadi va shu tugmalarni bosganda botdan javob qaytmayaptii yordam berib yuboring",
      "mana shunga yoʻl koʻrsatib yuboring",
      ".",
      "javascript darslari yaxshi tushunolmayabman () {} [] : ; mana shu 5 ta belgi qaysi joylada ishlatilishini aytilmagan qanaq qilib bilsam boladi",
      "Umumiy catda yozgan edm javob bera olaszmi zarur edi",
      "(){}[] : ; `` belgila haqida hech qanaqa maʼlumot yoʻq darslikda har kod yozganda xato qvopman darslikga tuzatish kiritsayla bomidimi eskirib qogan, yangilash uchun sababla borku",
      "tushuntirib yuboring",
      "Assalomu Aleykum, Bootstrap kursi yakunida Loyiha 1 uchun berilgan namuna sayt ishlamayabdi nima qilish kerak, oldindan rahmat javob uchun",
      "Assalomu alaykum Django + websocket loyihaga qaysi arzon serverni maslahat berasizlar, hostinga boʻsayam mayli (agar qoʻllasa)",
      "Dars koʻrmoqchi bosam shunaqa bop qovvoti, bunaqa kok yoki jigarang effekt bilan koʻrib bomidiku",
      "assalomu aleykum aka men bonus darslardan payme integratsiyani ko'rayotgan edim lekin paytechda ancha o'zgarishlar bo'lib ketibdi merchant api metodlari yo'q ekan nima qilsam bo'ladi",
      "Assalomu alaykum siz bergan kod natijasi",
      "bunday bo'lib qoldi qanday qilib o'z holiga qaytarsam bo'ladi",
      "Videosini tashlab qoydim lichkaga, baribir ochilmayabdi",
      "sayt ishlamayabtimi praktikum",
      "Assalomu alaykum mening ham muammoga yechim koʻrsatib yuborinh",
      "ertangi savol-javob suhbatda ozroq fastapida websocket bilan ishlash bo'yicha kichikroq biror narsa bilan ko'rsatib tushuntirib berolasizmi iloji bo'lsa shunday qiling",
      "shunga yordam berib yuboring anchadan beri qila olmayapman",
      "Live Server juda sekin ishlayabdi, qotib zagruzka bo’lib, nega unday bo’layabdi",
      "shu qism menda ishlamayapti.",
      "Akalar bir ko'rib beringlar kamchiliklari bo'lsa aytib yuborasizlar. Kecha yakunlagandim",
      "Cssda loyahani yaxshilayotgandim lekin clearfix{clear:both;} ishlamayapdi va rasmga width va height bersam ham o'zgarish bulmayapdi nma qilsam buladi",
      "assalom alaykum Accordion yaratyapman. lekin Item ochilsa yopilmayapti, yopilsa ochilmayapti",
      "Shu Manda oxshamaydi manimcha .html da kodni óqiy olmayabti",
      "Css ishlamayabti",
      "Assalomu aleykum postgresqlni o'rnatmoqchidim lekin o'rnatilmayapti shu nimaga nima qilsa bo'ladi windowsgaqanday qilib o'rnatadi shu bo'yicha ozgina ma'lumot bervoringlar kimdir qilgan bo'lsa",
      "Assalomu alaykum, Asadbek Iltimos, savolingizni aniqlashtirib tegi bilan yuboring.",
      "asosiy mainga qoshmoqchi bolsam shunday bolyapti qo'lda tanlab chiqishim kerakmi ozgartirgan joylarimni to'liqroq malumot bera olaszmi",
      "tug qildimmi kuringchi",
      "oxirida amaliy loyiha uchun ko'rsatilgan namuna sayt ishlamayotgan ekan, shu sayt materiallarini qayerdan olamiz yoki o'zimiz istalgan ko'rinishdagini qilamizmi?",
      "iltimos yordam bering nega menda shundey chiqyabdi",
      "Ассалому алейкум сайтга кирсам шундай чикябди",
      "Assalomu alaykum, Abdurauf Agar savolingiz mentorga bo’lsa, iltimos, tegidan foydalaning.",
      ", js loihasini topshirishda nima qilish kerakligini va vazifani qanday bajarish kerakligini umuman tushunmayapman, darslarni qayta-qayta ko'rsamhm, boshqalardaham shu holat kizatilyaptimi yo faqat man tushunmadimmi?",
      "Birinchi savolingizga javob olgansiz, ammo ikkinchi savolingizda tegidan foydalanilmagan. Shu sababli mentor savolingizni ko‘rmay qolgan bo‘lishi mumkin. Keyingi safar iltimos, tegini qo‘llang va agar javob olmasangiz, savolingizni yana bir bor yuboring. Savollar ko‘pligi sababli mentor ba’zan savollarni o‘tkazib yuborishi mumkin.",
      "bu qism ishlamayapti",
      "Assalomu aleykum nega error beryapti",
      "Menda shu muammo aslo hal bo'lmayabti, css da media-query orqali va yo bootstrapda navbar expanded orqali md(768px) ni ko'rsatsam,kodlar umuman amal qilmaydi, lekin lg(991) va undan kattaroq o'lchovni ko'rsatsam yaxshi amal qiladi, Shunga hayronman, biron biladiganlar bo'lsaham yordam bervorilar",
      "Menda shu muammo aslo hal bo'lmayabti, css da media-query orqali va yo bootstrapda navbar expanded orqali md(768px) ni ko'rsatsam,kodlar umuman amal qilmaydi, lekin lg(991) va undan kattaroq o'lchovni ko'rsatsam yaxshi amal qiladi, Shunga hayronman, biron biladiganlar bo'lsaham yordam bervorilar",
      "test yaratilmayapdi nima qilsam boladi?",
      "<p> da xatboshi tashlash, ya'ni joy tashlash qanne bo'ladi? Masalan: Xatboshi",
      "Assalomu Aleykum,shu Website yozuvli rasmni kerakli hajimga keltirolmayabman, belgilangan width va height ni orasiga to'liq korinishda joylay olmayabman, iltimos yordam bering",
      "Файл хажми копайб кетди нима килсам болади?",
      "Ассалому алайкум. Job applicationni жўнатгандим, аввал муваффақиятли, кейин ҳали текширилмади деган ҳабар келди, текшириб ҳабар берамиз дейилганиди. Лекин ҳали ҳеч қандай ҳабар келмади, 6 кун бўлиб қолди.",
      "Assalomu alaykum. HTMLda biz internal link yaratganimizda hosting qilgandan so'ng muammo bo'lmaydimi",
      "Assalomu Aleykum, Iltimos yordam berib yuboringlar.🙏🏻 JavaScript domi boshlang'ich holatda turibdi, kodni davom ettirib beringlar,shu kodni to'g'ri ishlaydigan qilib yoza olmayabman. Ushbu brouser oynasigadagi, 3 ta buttonlardan biri bosilganda, ya'ni sayt ichidagi . Agar ( id: )si (all ) Buttoni bosilsa o'sha nomdagi html filesiga o'tadigan qilib, Agar ( id: )si ( websites ) Buttoni bosilsa, o'sha nomdagi html filesiga o'tadigan qilib, Agar ( id: )si ( contacts ) Buttoni bosilganda o'sha nomdagi html filesiga o'tadigan qilib JavaScipt kodini yozish kerak. Hullas all nomili html filesidagi 3 ta button orqali JavaScript kodini ishga tushirish. Va u JavaScript kodi 3 ta buttonga, bittadan html filesini ulash. Kegin o'sha ulangan fileni brouserni oynasida yangi sahifaga o'tdi qilib ko'rsatish kerak.",
      "Assalomu Aleykum, Iltimos yordam berib yuboringlar.🙏🏻 JavaScript domi boshlang'ich holatda turibdi, kodni davom ettirib beringlar,shu kodni to'g'ri ishlaydigan qilib yoza olmayabman. Ushbu brouser oynasigadagi, 3 ta buttonlardan biri bosilganda, ya'ni sayt ichidagi . Agar ( id: )si (all ) Buttoni bosilsa o'sha nomdagi html filesiga o'tadigan qilib, Agar ( id: )si ( websites ) Buttoni bosilsa, o'sha nomdagi html filesiga o'tadigan qilib, Agar ( id: )si ( contacts ) Buttoni bosilganda o'sha nomdagi html filesiga o'tadigan qilib JavaScipt kodini yozish kerak. Hullas all nomili html filesidagi 3 ta button orqali JavaScript kodini ishga tushirish. Va u JavaScript kodi 3 ta buttonga, bittadan html filesini ulash. Kegin o'sha ulangan fileni brouserni oynasida yangi sahifaga o'tdi qilib ko'rsatish kerak.",
      "Assalomu alaykum yaxshimisiz. Menga yordamiz kerak edi. 1 saytdan ma'lumot olishda muammo bo'lyapti yordam berasizmi",
      "biror narsa deasngiz bo'lardi yoki bilmayman debmi, shunaqa melochi narsalar deb shu darsdan sovub ketadi odam, dars qilmoqchi bosa ishlatmoqchi bogan narsalar ishlamasa.....",
      "Assalomu aleykum, CSS modulidagi vazifangiz tekshirildi. Bahongizni koʻrishingiz mumkin deb javob keldi leykin xechqanaqa feedback berilmagan.",
      "Assalomalekum ma'mulotlarni kiritdim lekin pdadminda ko'rsatmayaptida",
      "Assalomu aleykum jadval yaraldida mana: lekin postgers da ulanmebdida",
      "Assalomu alaykum Iltimos, savolingiz mentorga bo‘lsa, tegidan foydalaning.",
      "Assalomu alaykum, drf bo'yicha savolim bor edi userni ro'yxatdan o'tish qismi ko'rdim va kodlarni yozib chiqdim, lekin asosida qanday ishlayotganini tushunmayapman misol : so'rov kelganda urls ga keladi va view ga o'tadi keyin serializerda tekshiradi shulani ketma ketligida tushunmayapman agar iloji bo'lsa, telegramdan yoki google meet danmi 15- min suhbat qilsam o'rganishimga yaxshi bo'lardi",
      "biz ham qushilsak buladimi",
      "Assalomu alaukum men Python Asoslari modulini tugatdim va yakuniy savollarda 1 tadan kop variantni tanlash mumkin bolgan savollar bor ekan shularda xato belgilab balim pastlab ketti va modulni tugatib keyingi modulga otmoqchi bolsam 74 qaytadan boshlash chiqayapti men shunda qaytadan boshlasam videodarslarni yana boshqatdan korib chiqamanmi?",
      "login ishlayabdi logout deb kirsam xatolik berayabdi",
      "Assalomu alaykum testlashni qanday yaxshilab oʻrgansam boʻladi, masalan tox va ini fayllar bilan ishlash test yozishlarni. Yaxshi adabiyotlar/resurslarni ulashsangiz hursand boʻlar edim.",
      "Postgresqlni windows uchun o'rnata olmayabman",
      "Assalom Aleykum, sodda telegram bot yaratish darsiga keludim va dars bo'yicha deyarli bir xill qilib kod yozdim lekin menda o'xshamadi No module: telebot degan xato chiqvotti lekin darsdagi kabi kod yozganman telebot modulini chaqirdim darsda command promt orqali telegram bot api yuklab olingan men pycharm dan foydalanaman anacondadanmas shunchun terminal orqali telegram bot api niyam telegram bot oxirgi versiyasiniyam python3 degan narsasiniyam qisqa qib aytganda nima bosa hammasini yuklab oldim chatgpt orqali (api degan narsani umuman tushunmadim) xullas xatolik telebot moduli mavjud emas devotti yordam bervorila",
      "Assalom Aleykum, sodda telegram bot yaratish darsiga keludim va dars bo'yicha deyarli bir xill qilib kod yozdim lekin menda o'xshamadi No module: telebot degan xato chiqvotti lekin darsdagi kabi kod yozganman telebot modulini chaqirdim darsda command promt orqali telegram bot api yuklab olingan men pycharm dan foydalanaman anacondadanmas shunchun terminal orqali telegram bot api niyam telegram bot oxirgi versiyasiniyam python3 degan narsasiniyam qisqa qib aytganda nima bosa hammasini yuklab oldim chatgpt orqali (api degan narsani umuman tushunmadim) xullas xatolik telebot moduli mavjud emas devotti yordam bervorila",
      "validation mavzusida foydalanilgan adabiyot kerak",
      "shu qismidagi rasm navbarning ustiga chiqib ketobdi nma qilsam buladi",
      "!important ham yordam bermayopdi",
      "Shunaqa bulib qolyabdi nima qilsam buladi",
      "Bu xato nima sababdan chiqdi",
      "Bu qanday xatolik",
      "validation mavzusida foydalanilgan adabiyot kerak",
      "qilganimda xatolik berayabdi nimadan ekanligini tushunmadim yordam berib yuboring",
      "men imtihon oladigan test ishlaydigan projectni backendini yozmoqchiman buni qaysi frameworkda yozganim maqul FastAPI dami yoki Djangodami. O'zim djangoni yaxshiroq bilganim uchun djangoda yozmoqchiman lekin keyin test ishlayotganda muammo bo'lmaydimi shunga ikkilanyapman shu bo'yicha maslahat bersangiz",
      "Assalomu alaykum yaxshimisizlar? Menda shu profile/edit qilsam user ma'lumotlari chiqmayabdi o'zgartirish uchun",
      "birinchi websiteni yaratish uchun TextEditni yuklagandim lekin yaratolmayabman boshqa yana qaysi blaknotdan foydalansam bòladi",
      "nima uchun saytdagi vidiolar korsatmayapti",
      "nega slqdagi loyiha tushunarsiz uncha chunmadimda chuntirvoring",
      "Assalomu aleykum darslarga zor chundim lekin loyiha chunarsiz ekanda chuntirvoring lich🤝",
      "postgre sql qanaqlb o'rnatiladi darsda mac uchun o'rnatish ko'rsatilgan, windows uchun shu joyigachan endi nima qilish kerak",
      "postgre sql qanaqlb o'rnatiladi darsda mac uchun o'rnatish ko'rsatilgan, windows uchun shu joyigachan endi nima qilish kerak",
      "Nimaga bunaqa bovati 20 minutdan beri shunaqa",
      "Menda ham shu muammo boʻldi. Oʻrnatishlarni youtube dan koʻrib qilib oldim, lekin dars davomida ustoznikidek ishlamayapti terminal shunga qiyinchilik boʻlyapti. Bunday jihatlarini mentorlar hisobga olishlari kerak edi.",
      "Dars boshida degan faylga ulandi menda bunaqa fayl yo'q ekan ulanmadi terminalga yozsam, bu papkani qatga ochsam bo'ladi ekranga desktop degan papka ochsam bo'ldimi keyin ulanadimi, ko'p buyruqlayam ishlamadi dir pipenv yana shunga o'xshash yoki bula windowsda boshqacha yoziladimi",
      "1 soatdan beri shunday turib di nima qilish kk",
      "Salom, darsni videosi chiqmay qoldi, qayta kirsa ham, nima qilish kk?",
      "Assalamu aleykum bu references qilsam oshibka berib turubdi",
      "Mavzu: Foydalanuvchi parolini qayta tiklash 1-qism Mana shu kodni yozgandan keyin ustozning loyihalarida link consoldami terminaldami chiqdi lekin mening loyihamda yozsam bu kodni link chiqmayapti",
      "faqatgina main page qilinsa buldimi ?",
      "stylesheet, css/main, <!--header section-->ga e'tibor berilsa tartibli har xal ranglarda, aynan shu plagin qaysi plagin?",
      "Django asoslari (YANGI) darslari nimaga tartibsiz o'tilgan bitta mavzuni o'zida tushunmidigan narsalar kopakan qolgan darslarda tartib bilan birinma ketin harbir narsani qayerdan kelib chiqan tushuntirib berilgan bu darsada otayam tartibsiz tez otilganmi tushunib bolmayabdi",
      "PostgreSQL windowsga o'rnatish vidoyda ko'rsatilmagan ekan qanday o'rnatish kerak javob beringlar",
      "Mavzu: Ko'rishlar sonini aniqlash hitcount da xato beryapti lekin ustozni vediosidagidek o'rnatdim pip freeze qilib tekshirdim o'rnatilgan lekin qizil bermoqda.",
      "tartib bilan o'tilgan, faqat umumiyroq tushuncha berilgan, tushunmagan joyingizni gruhda hashtagi bilan berishingiz mumkin",
      "JS modulining so‘ngi amaliy vazifasini tushuntirib bering. Biz ip addressni brauzerda kiritamiz va natija ham brauzerda chiqishi kk mi Yoki js faylga malumot kiritib natijani consolda chiqaramizmi?",
      "assalomu alaykum loyhani admin qismi bilan ishlash darsida korsatilgan media folder ni qattan topse boladi?",
      "nima bo'ldi? Tekshirdingizmi",
      "postgresql yonmyapti shunga yordam bervoringla",
      "Assalomu alaykum ustoz shunday muammo bo'layotgan edi hammasini to'g'ri bajargandim oldin ham ko'p ahost ga muammosiz web app ni joylashtirar edim lekin xuddi shu yo'l bilan bo'lmay qoldi negadir endi",
      "sevris kardlarini nimasini to'g'irlashim kerak ?",
      "modeltranslation oʻrniga qoʻlda title_uz title_ru deb maydonlar qoʻshsa keyin tilni tanlash qismini qoʻlda yozsa ham boʻladimi",
      "rahmat kattakon",
      "shu joyda qaysi birini belgilash kerak? yordam bervorila",
      "??? ☝️",
      "nega bunaqa xar xil til bo'b chiqvotti nimaga",
      "Assalomu alaykum men kursni ko'rib kodlarni yozib bajarib boryapman lekin o'zim keyin vedioga qaramasdan shu kodlarni yoza olmayapman yani mustaqil birorta loyiha qila olmayapman. Masalan ustoz erkin qayerda qanday funksiya yoki class va umuman olganda nima ishlatishni bilyapti men ham qanday qilib o'zim mustaqil loyihalar yozadigan darajaga chiqishim mumkin. Yaxshiroq va samaraliroq o'rganishim uchun nima qilishim kerak?",
      "asslom alleykum , yaxshimiszlar , nimaga CSS dan uyga vazifani, zip file yoki git hubga yuklaganimda bu faylarni ochmayapti faqat shunaqa fayl ochyapti yordam bervoringla iltimos , man Pycharmda bajarganman CSS uy topshiriklarni",
      "Assalomu aleykum hammaga. 19chi videoga kelib muammo chiqib qoldi. Videoda full ekranda o'ng va chap tarafdan otstuplar yoq. Lekin manda shular paydo bo'lopti. Shuni qanday sozlasam bo'ladi?",
      "Sahifaga kirganda login & signup o'rniga logout turibdi 2-rasmda, 1-rasmda hali login qmasdan turib logout turibdi, search ga accounts/login/ deb yozsam login qilish sahifasi chiqvotti foydalanuvchi bunaqb yozib otirmidiku shulani to'g'irlashga yordam bervorila",
      "drfda kutubxona loyihasi railwayapp ga deploy qilingan ekan. Hozir ham ishlayaptimi yaqinda bot qoʻymoqchi boʻlganimda ishlamagandi",
      "Assalomu alaykum html{ scroll-behavior: smooth; } menda ishlamayapti nimadan bulishi mumkin",
      "!important quydim shunda ham ishlamadi",
      "Assalomu alaykum yonidigi filter manda chiqmayapti huddi shunaqa qilib code yozdim, ammo menda filter ishlamaypti nega yordam beraolaszmi?",
      "Assalomu aleykum. Men notebookda html asoslaridagi birinchi darsni qaytadan yozib chiqqan edim. Nimagadir xato ketdi shekilli. Oʻtgan safar oʻxshagan edi. Endi oʻxshamayapti?",
      "Assalomu aleykum. 19-qatordagi kodni ko'rib bering. Nimaga u markazda joylashmayapti?",
      "Python asoslari modulida o'rgangan kodlarimizi qayerda ishlatamiz, djangoda hali ishlatganimam yo, faqat class def return shu 3ta so'z ishlatdim darslikda, python nimaga kerak o'zi ishlatilmasa, pythonda oddiy kalkulyator kodini yozgandan keyin uni copy qilib yoki shu usulda qayerdadur ishlatsa bo'ladimi, hamma joyda har xil ishlatilarkan. Pythonda dastur yozdim restoranlada bo'ladigan menu lekin uni run qilib yoki consol bilan ishlatishmidiyu restoranda, boshqa til yoki frameworkda xuddi shu kodni boshqacha yozish kerak bo'larkan, unda pythonda kod yozib faqat consolda natijani ko'rishdan nima foyda u ishlatilmasa",
      ". shu xatolikni to'grilolmayapman",
      "Assalomu Alaykum zip varinatti bu.",
      "Django darslari, terminalda yozishga qiynalvoman brew shunaqa narsala windowsda ishlamayabdi. MacOS da terminalda berilgan ko'p buyruqla windowsda ishlamayabdi windowsda qanaqa yoziladi u nima qilish kerak",
      "Assalomu alaykum, Rakhm Iltimos, savolingizni yanada aniqlashtirib, heshtegi bilan yoki uning oʻzini teg qilib yuboring. Shunda savolingizga tezroq javob olasiz.",
      "Assalomu alaykum bu vedio uchrashuvni yozib olingani qachon saytga yuklanadi yoki qayerda ko'rishi mumkin",
      "Assalomu alaykum yaxshimisizlar. Bir yordamlariz kerak edi? Modeltranslate orqali news detailda yangilini tarjima qila olayabman. Lekin men yangilikni uchta tilda kiritayabman. Home da faqat uzbek tilidagisi chiqayabdi qanday qilib boshqa tildagilarini ham chiqarsam bo'ladi. Bilganlar yordam berib yuborizlar.",
      "menda db.sqlte3 o'chirib tashasam ham yana qaytib paydo bo'b qovoti, ustozda bittada o'chdi, 2 marta o'chiridm yana paydo bob qoldi",
      "menda template folder degan funksiya chiqmayabdi",
      "Shu videoni bir ko'ring",
      "Assalomu alaykum faylimni haligacha kurmabsiz",
      "Assalom alekum HTML asoslari oxirida job application da mana shunaqa muammo bo’lyapti. Validatorda tekshirganda sariq bilan belgilab xatoni ko’rsatyapti lekin qanday qilib to’g’irlashni bilmayapman. Yordam bervorilar",
      "Assalomu alaykum \"Yangiliklar sayti shablonini django'ga o'rnatish\" darsiga keldim. Darsda internetdan shablon yuklab olingan ekan. Lekin bu sayt hozirgi vaqtda ishlamayapti. Shablonning zip shaklini tashlab yubora olasizmi?",
      "Assalomu alaykum! Men Bootstrap modulini 2024 - yil oktyabr oyida tugatgan edim. adashmasam vazifasini vaqtida topshirgandim. bugun yangi joylangan testlarni ishlab tursam menda topshirilmagan vazifa bor ekan. odatda darslarda qilgan ishlarim va vazifalarni github sahifamga yuklab qo'yardim. O'sha paytda yuklab qo'ygan vazifamni yuborsam boshqa yuboribsiz deb javob keldi. Darsni ko'rib vazifalarni bajarganimga ancha bo'lgan, yangi vazifani topshirish uchun yana qayta darslarni boshidan ko'rib chiqishim kerakmi? Hadeb o'zgartirishilar kiritavermasdan bitta qat'iy qilib qo'ysangizlar bo'lmaydimi? O'zi darslaringizni 2023 - yili sotib olgandim. O'tgan yili yozdan qayta boshidan boshlagandim, xech oxiriga yetib bo'lmayapti. sharrillatib darslarni ko'rib ketish mumkin, lekin tushunish uchun vaqt kerak bo'lyapti",
      "menda VS code da shunaqa muammo bo'lib yozgan kodim run bo'lmayapti",
      "Django render deploy qildim logda xatolik yoq. admin/ ishlayapti accounts app urllari ishlayapti posts app urllari ishlamayapti Server Error (500) qaytaryapti. bunda modeltranslation bor. Va url i18 n ichiga yozilgan",
      "Asslamu aleykum sababi nimadan ekanligini bilasizmi?",
      ", Assalomu aleykum, shu FullStack python kursini tamomlaganda, yasagan web saytlarni, mibile dasturlarga o'tgazishni(ya'ni mobil dasturlar yasashni)-ham udalash mumkinmi, yoki uning uchun alohida kurs o'qish kerakmi yana?",
      "man oddiy html, css, js da sayt yasab uni netlify, vercelga hostingga qo'ysam sayt linkini bosganimda faqat html markup yozilgan holatda ochilvoti, lekin css style, js funskiyalar korinmayapti. sayt oq backgroundda qora yozuv bolib ochilvoti. proyektimni ichki tuzilishini skrinshotini va netlifyga qoygan saytimni linkini ham jonatvoman. html kodda css, js kodlarni to'g'ri ulaganman lekin baribir ishlamayapti. tuzatishga yordam bervorila iltimos:",
      "Va alaykum assalom! Tushunarli rahmat! Saytda vazifamni yuklab bo'lmayapti, Yuklanmoqda degan yozuv turibdi holos. mb kichraytirdim.",
      "Assalom alaykum. funsksiyada return, arraylarda ko'pgina metodlar masalan, slice() larni qaytaradi deyapti video darslikda . shu haqda tushuncha bersangiz. qaytaradi deganda nimani nazarda tutyapti? uni qanday ko'rish mumkin? qaytarish aslida nimaga kerak?",
      "Assalomu alaykum men qila olmadim bir vaqt ajratib video vizov orqali tushuntira olasizmi imkoni bo'lsa",
      "Shu yerdagi No Gil bouyicha darslik joylanadimi yoki endi tayyorlanayabdimi?",
      "html kursini ohirida Job application loyiha ishi topshirish kerakku, topshirdim, uni tekshirilishiga qancha vaqt ketadi?",
      "Assalomu alaykum Kursni oʻqish uchun qanaqa komputer sotib olgan yaxshi",
      "Assalomu alaykum web saytni ahostga joylash bo'yicha yordam kerak.",
      "Assalomu alaykum, iltimos agar savolingiz mentorga bo‘lsa, tegidan foydalangan holda yuboring. Shunda mentorlar sizga tezroq yordam berishadi.",
      "Assalom alaykum. . Bir savolim bor edi. jsda dom elementlariga murojjaat qilishni qanday yöllari bor? sal tushunmovchilik bo'lyapti? masalan <p id=\"info\"> Salom dunyo </p> const element=document.getElementById(\"info\"); element.textContent=(\"yangi matn\"), 2-3- qatordagilarda qanday o'zgarishlar böladi?",
      "Assalomu aleykum, men endi sql darsiga yetib keldim va shu kungacha videodarslarni yutubedan balandroq kachestvada yuklab olib ko'rardim, chunki bizda doimiy internet yaxshi ishlamiydi va har doimham darslarni onlayn ko'rish imkoni yo'q. O'shanga bu videodarslarni biron erdan yuklab olish iloji bormi?",
      "Assalomu alaykim yaxshimisiz Django bo'yicha yordam kerak saytda file upload qism bor edi serverdan serverga ko'chirilgan vaqtda oldingi fayllarni rasmlardan boshqa hammasini taniyapti biroq aynan rasmlarga 404 berib orqasidan / qo'yib yubormoqda nega nima qilishim kerak?",
      "Assalomu alaykum yaxshimisiz. Shunaqa holatda settingsda STATICFILES_DIRS belgilamasa ham boʻladimi",
      "Assalomu alaykum, html yakunida bajariladigan topshiriqni yakunlab saytga joylagandim, iltimos tekshirib bering.",
      "Assalomu aleykum Portfolio yasavotudim muammoga duch keldim shu \"img\"ga margin-bottom bilan left to'g'irlash kerak edi nimanidir noto'g'ri yozvoman shekili ishlamiyapti? Lichga yozvorin iltimos \"kod\"imi ko'rib berin qatta hato qildim",
      "Assalomu alaykum ayollar guruxi bor boʻlsa meniham qoʻshib qoʻyolasizmi?",
      "Job applicationni qanday yuklaymiz ? Shunga yordam berib yuboring.",
      "Assalomu alaykum. HTML dagi oxirgi Job application sahifasini yasayapman shu ko'payib, kamayadigan inputni HTML orqali qilsa bo'ladimi?",
      "Yordam kerak edi lichkaga yozvorin iltimos",
      "Assalomu alaykum Nimaga chrome ga o'tganda you tubedan bir xilgi videolarni ochmayapti",
      "Assalomu alaykum yozib olinayotgan vedio uchrashuvlar nega qo'shib borilmayapti oxirgisi mart oyidagi vedio uchrashuv ekan",
      "Assalomu alaykum, Abdulbosit. Agar savolingiz mentorga bo‘lsa, iltimos, tegidan foydalaning.",
      "Assalomu alaykum tekshirib berasizmi",
      "Saytga kirganda developer tools chiqmayabdi nima qilsam boladi",
      "Assalomu alaykum Jadvalga berilayotgan style ishlamayapti",
      "assalomu aleykum manabu tangacha 1k dan keyin oshgani yo'q nega. yulduzcha bilan teng ketayotgandi",
      "Assalomu alaykum CSS darslaridan keyin faqat test yechyapman Amaliy mashg’ulot uchun biror manba bormi? yoxud darsni mustahkamlash uchun qanday ishlarni qilishni maslahat berasiz?",
      "Assalomu alaykum, Agar savolingiz mentorga tegishli bo‘lsa, iltimos, tegi bilan yuboring.",
      "menda savol bor edi,CSSni endi boshladim.Loyixa,Images,papkalarini ochaman desam explorerda papka ikonkasi chiqmayapti,text fayl ikonkasi chiqyapti,quyida skreenshotda jo`nattim,shunga yordam bering",
      "Assalomu aleykum. Agar refresh token bilan yangi access tokenlarni ololsak, refresh tokenni o'zini qanday yangilaymiz. Va biz User.token() orqali token refresh va access token juftligini olamiz, va endi uning refresh tokeni bilan yangi access token olganimizda eskilariga nima qiladi, bilaman vaqti tugaydi lekin tugaguncha ular hali ham aktiv bo'ladimi?",
      "Sql la bormi",
      "Assalomu alaykum, menda ushbu sectionda backgraundagi sariq tolqinni pastki qismi tekis bolib qolmoqda pastini xam tolqin xolatda qilish uchun nima qilish kerak?",
      "Ассалому алайкум SELECT ga kirish darsi 10:17 birthday бизада DATE эди нега '1990-03-03' ичида булди",
      "CSS loyihani yaxshilash darsligida yozilgan kodlar umuman ishlamayapti, aytilgandek loyihani qilib koʻrayotgan edim CSS ishlamayapti",
      "Assalomu alaykum men saytiga noutbukdan kirsam siz bloklangansiz deyapti lekin telefondan kirsam saytga kiryapti shuni to'g'rilashni iloji bormi nega bunday bolyapti",
      "Assalomu aleykum modul oxirida berilgan tasklarni mentor eng uzog'i qancha vaqtda tekshiradi?",
      "Assalomu alaykum, Agar savolingiz mentorga bo‘lsa, iltimos, xabaringizni tegi bilan yuboring.",
      "assalomu alaykum boostrapda darslikda yozilgan style ni yozsam ishlamadi",
      "assalomu alaykum boostrapda darslikda yozilgan style ni yozsam ishlamadi",
      "javob beradimi yoʻqmi",
      "men darslikda yozilgan kodni namuna qilib yozib koʻrdim ishlamadi javob bering",
      "Ikonka qo'shgandim ko'rinmayapti ko'dni tekshirib ko'rdim xatosi yo'q. Manimcha sayti o'zu ushlamiyapti o'shani o'rniga boshqa sayt maslahat berin iltimos. Yana qattan ikonkalani qo'shib osam bo'ladi?",
      "qarab berin shuni iltimos",
      "Neftlifyda qildim faqat rasm yuklamadi, githubda image fayl ichiga kirib rasm yukladim yuklandi, ammo neftlifyda koʻrsatmayapti rasmni css da berganman, oʻzimni browzerimda koʻrinyapti faqat",
      "Assalomu aleykum . HTML darslaridan bu testni ishlay olmayabman. Ko'p martta urunish bo'lgani uchun blocklandingiz deyabdi. Lekin bu testni bir martta ham ishlab ko'rganim yo'q. Nima qilsam bo'ladi?",
      "Assalomu alaykum. bootstrap yakunlanayotgan qismdagi loyiha linki topilmayapdi yoki boshqa malumot chiqyapdi, shunga togri link kerak.",
      "Vs codeda cod yozuvdim brauzerda ochishim kerak Ustoznikidaqa qilib saqladim lekin na ekranda na documentlarimda chiqayapti bu faylim saxranit bomayaptimi tushunmayabman Qayta qayta yozyabman Lekin bomayapti hech qayerga saxranit bomayapti",
      "assalom alaykum vs code da cod yozgan edim ustoznikidek yozdim lekin body hato chiqyabdi nima qilay",
      "ustoz niki bilan birga yozdim lekin rasm chiqmayabdi",
      "bu nega xisoblamayapti?",
      "biz bu tableni ichidagilarni belgilaydigan qilishni bilmaymizku pastini ham yumaloq qilib raqam yoziwni bilmaymizku",
      "css kurs loyihani tekshirib bering. To‘lqinbekova H.",
      "Nima qilsam boladi?",
      "Superuser passwordim esimdan chiqib ketibdi, qanday yangilasam boladi?",
      "Nimagadir har safar vs code dasturini ochyotganimda qaytadan ustanovka qilish chiqvotti Bomasa ochilmidi",
      "Savol Men rasm qoyolmayapman Har xilcha qilib saxranit qilib kordim rasmlarni .html Jpg Lekin bomayapti",
      "Job Applicationni baholab bering",
      "man neftlifydagi linkimni yuklasam maylimi aniqroq koʻrinadi",
      "Assalomu alaykum, Amaliy vazifani bajarishda va yuborishda qiynalgan joylaringizni batafsil tarzda tegi bilan guruhda yuborsangiz, mentor sizga yordam beradi. Iltimos, qaysi vazifada va aynan qaysi joyda qiynalayotganingizni yozing. Shunda mentor savolingizni tezroq ko‘rib chiqadi.",
      "Assalomu alaykum, agar savolingiz mentorga bo'lsa tegidan foydalaning va biroz sabr qiling mentor javob beradi.",
      "Assalomu aleykum Samigjanovni note larini tashlab berasizmi dars o'tganda foydalangan javascript uchun",
      "loyihani topshirishda (zip fayl va link so’raydi ) o’sha link yoziladigan joyga nimani linkini yozamiz ???",
      "bu men yozganim oʻzgarish kiritaymi yoki yuboraymi",
      "boshqa fayl ketib qolibbdi iltimos atkaz qivurmen hech kim ideal kod yozomidi menam boshqa bolimga ota qoli iltimos, yoki boshqa fayl yuborish imkonini qiling,man qilgnman nima bolsayam qaytarvurmen boshqa bolimga qachon otaman adashib boshqa fayl ketib qolibdi html kodni ozi qaytarmen faqat boshqa bolimga oti css bolimini boshidan boshlab test yechib yurvuramanmi",
      "uzur ozi ancha vaqt yoqotvomman bitta faytl adashib ketib qolibdi shu sabab qaytarmela iltimos html kodni ozi boshqa bolimga ota qoli",
      "Assalomu alaykum Css 54chi darsidagiday buttonga trasition bersam ishlamayapti transitionsiz qanay bosa xuddi shunaqa turobdi nma qisam bolai qanaqa xatolik bor korib berasizmi",
      "Men HTMLni tugatib loyihamni jo'natgan edim lekin hali javob kelmadi 50 soat bo'ldi",
      "korib bervoring iltimos",
      "bu nma boldi kormadizmi hali",
      "Django #09 darsda Anvar Narzullayev loyihani HEROKUga yuklab korsatib beribdi. Men unday qilmay qoyaveraymi, baribir pullikku qo'yolmaymana?",
      "loyihani yubordik tekshirib bering (Hanifa To'lqinbekova)",
      "korib bervoring",
      "qayerda hato ketyabdiki min-widht ishlamayapti?",
      "шуни ўзгартирмай қайта юклайверайми",
      "manikini ham tekshirib bering adashib tayyor mas fayl yuboribman o’shani muvafaqqiyatsiz qilib bering",
      "aytganiznigizdek qilindi tekshirib bering",
      "Assalomu alaykum Mana bu rasmni yoniga textimni joylashtirmoqchi edim lekin hicham bomayapti Chat gptdan ham soradm u bergan kod sovsem boshqacha lekin unikini qilib kordim undayam oxshamadi",
      "HTML moduldagi job-application formni qanday formatda yuklash (jo'natish) kerak",
      "pasdagi textlar chiqib qolyabdi sizga oxshab clear qilsam tushmayabdi yordam berib yuboring",
      "mentor javob bermadizku korib bervoring shuni ummuman oxshamayapti",
      "Yoki darslikda berilgan saytni qilib zip qilib joʻnatsak boʻladimi, yoki buni qilaylikmi",
      "Men bir narsani judayam xohlayman, darslikda qilingan loyihalarni havolalari bilan koʻrsatishsa, qilishga harakat qilib koʻrsak, biz uchun yanada yaxshiroq boʻlardi, masalan CSS loyihani, Boostrap loyiha havolalari boʻlsa edi",
      "... Masalan Boostrapdagi darslikda koʻrsatilgan havola loyihasi ishlamadi, ishlaganda qilib koʻrardik, yaxshiroq tushunardik",
      "shu joydagi background imagesini qoysam pasti tekkis bolib qolyabdi height yetarli bir xil qilib qoydm lekin pasti tekkis bolib qolyabdi",
      "assalomu aleykum bonus darslarni ko'rish ihtiyoriymi yoki shartmi ishga kirish uchun?",
      "Assalomu alaykum sertifikat boyicha kim bilan gaplashish kerak",
      "Assalom alekum. Yordam kerak edi. Javascript da lani tushinish qiyin bo'lyabti.",
      "Nega (Positioning yordamida loyihani yaxshilash) dagi kodlar bizda ishlamayabdi bir xil qilsak ham umuman o'zgarmayabdi (Portfolio) qismi",
      "Men darslikda koʻrsatilganday kodam yozib qilib koʻrdim, oxirgi uchta konteyner noutbukda yarim ekrani ochiq qolib ketdi footer qismlari",
      "Assalomu aleykum. ketma-ket joylashtirish uchun nima qilsam bo'ladi avvlaroq tayyor kod tashlab bergan ekansiz lekin men tushunmadi urgatib yuboring.",
      "ohirgi footer background oq bo'b qoldi yoki boshqa hato bor, rangini ko'k qilish keregidi",
      "Amaliy loyiha yubordik tekshirib bering ( To'lqinbekova H. )",
      "kimdir bilsa tushuntirvorsin",
      "Newsprojectni qilishda login page qila oldim ammo logout uxshamayapti. Google meets orqali tushuntirib bering",
      "Menda signup darsida muammo bo'layabdi xotil sababini topa olmayabman. Imkoni bo'lsa yordam berib yuboring.",
      "assalom alaykum men fayllarni bossam vs codga otib qolyabdi nima qilsam boladi",
      "har biri uchun alohida chiqayapti shuni qanda yqilsam boladi hozir navbar qismini qildim zor chiqdi",
      "Parol tiklanmayapti",
      "Savolingizni tegi yordamida yuboring va mentorni o'zini ham belgilang. Mentor sizga batafsil tushuntirib beradi.",
      "saytda amaliy ishni yuborib bo'lmayabti ???",
      "manabunaqa xatoga duch kelganlar bormi, yordam bervorila",
      "Kodni tekshirib bering iloji bo’lsa(Manga qosa umuman tekshirmasangiz ham mayli. Ma’sulyatsizlik qilayotganila alam qilyapti faqat! )",
      "java script ni darslarini tugatdik amaliyotda ishlatib mashq qilish uchun qanaydir saytmi yoki boshqa usul bormi maslahat bersez. Umuman olganda Html css js ni yaxshi o‘rganib keyin pythonga o‘tmoqchimiz.",
      "amaliy ishni tekshirib bering",
      "Assalomu alaykum shunga bir javob berib yuborolasizmi",
      "Assalomu alaykum, Agar savolingiz mentor uchun bo‘lsa, iltimos tegidan foydalaning. Shunda savolingizga tezroq javob olasiz.",
      "Assalom Alaykum. Command promptda va Windows powershell da xam yozib ko'ryapman . Django - admin, pipenv buyruqlarida xatoliklar bo'lyapti nima qilsa bo'ladi",
      "Junior python backendchi bolish uchun: Django, DRF yetarlimi ?",
      "Assalomu aleykum. bu nimadan bo'lishi 'g'irlashga yordam bering iltimos",
      "bitta umumiy savol beraman hammaga qiziq FullStack Python kursini tugatsak qanday imkoniyatlar ochiladi Jamoangiz tarafdan qanday yordam bo'ladi nimadir imkoniyatlar ochib bera olasizlarmi, biz qanchalik mutaxassis bo'lib chiqamiz Savolimni umumiy tushundingiz deb o'ylayman Javob uchun oldindan raxmat ✊",
      "kursni JS gacha bitirdim bilimimni mustahkamlash uchun biron saytlar ayting o’yin saytlari yoki boshqa saytlar ?",
      "Postgresqlni o'rnatayorganmda shu xatolik chiqyapti qanday to'girlasa boladi",
      "Postgresqlni o'rnatayotganimda su xatolik chiqyapti qanday togirlasam boladi",
      "Postgresql o'rnatayotganimda shu xatolik chiqayapti qanday tog'irlsam boladi",
      "bu qismini ko'rib bolmay turubdi yechim?",
      "shu qismi nimadan shuna bolyapti,",
      "funksiya mavzusida qiymat qaytaruvchi negadir ishlamayapti python sariq dev dagi kodalrni ham ishlatib ko'rdim ishlamadi o'zim ham qilib ko'rdim ishlamadi nega",
      "Instagram Loyihasi Middle + darajadagi loyiha ekan kodlari SUPER Murakkab bizni darajamizga Mutlaqo mos emasku Nega Birdan bunday Qiyin loyiha qoyilgan",
      "Shu uchta page qilaman lekin basic form.elements bosganda chiqadigan alerts boshqa tugmalar uchun alohida page qilmiman, basic bosganda shundoq yangi pagega oʻtib ketadi, lekin alerts kabi tugmalari boʻmidi shunday qilaman",
      ". Assalomu alaykum. CSS darslaridagi videolar ochilmayapti. Shu muammoni bartaraf etib bersangiz.!",
      "jetbrains saytidan qaysi ilovani yuklashni maslahat berasiz",
      "3 ta jadval qilganman rasmdagilarga moslab birinchi jadvaldagi malumotlar chiqayapt kn yi jadvallarni chiqarsam aralashib chiqayapti",
      ". Assalomu alaykum CSS bo'limida topshiriq uchun berilgan web saytning Chat qisminging bottom uchun qo'yilgan background img ni ololmayapman kimdadir bo'lsa tashlab yuborsin",
      ". Assalomu alaykum. Menda quyidagicha muammo bo'layapti: Background uchun img va gradientdan foydalanganman va widthni kichiraytirsam o'sha background yig'ilib elementlar ochiq joyda qolib ketayapti, responsive nuqtaga kelmasdan (ya'ni aytmoqchimanki faqatgina desktopni o'zida tabe yoki mobile break pointlardan katta bo'la turib) uni qanday to'g'rilasam bo'ladi. Rasmda ko'rsatilgan kabi",
      ". Background yig'ilib ketayapti qanday tuzatish mumkin.",
      ". Yana bir savol bor edi. topshiriqda berilgan saytni scrol qilib pastga tushgan sayin animatsiyalar ishga tushayapti shuni faqatgina html va css dan foydalanib qilish mumkinmi",
      ". CSS 25 dars Positioning yordamida loyihani yaxshilash vedio darsida vediodagiday kod yoszam ham ikkinchi rasm oʻng taraf yonga oʻtmayapdi shuni qanday oʻtkazsam boʻladi",
      "Assalomu alaykum. Table dagi yozuvlar xato chiqaryabti.",
      ". CSS 32 dars Formalar yordamida loyihani yaxshilash vedio darsdagiday chiqmayapdi qayerda xato qildim",
      "Html uchun Job_Application Amaliy ishni jo'natdim tekshirib bera olasizmi",
      "django darslari (arxiv) da loyiha keroku ga yuklangan hozirham shunday yuklasa boʻladimi yoki pullik boʻlganmi?",
      "Assalomu aleykum django asoslari(arxiv) bilan muammo bo'lopdi",
      "topdim xatoni",
      "logout bilan bog'liq muammo bo'lyabdi",
      "crispy ishlamayopdi",
      "Assalomu aleykum \"edit\" xato beropdi.",
      "savol",
      "Shu saytidan ruyxatdan o'tdim, ammo loihamni yuklayotganimda ulanmayapti, chatgptdan so'raganimda karta ulash kerak deyapti, shunga maslahat bersangizlar unga biron visa karta ulash shartmi?",
      "yuqoridagi sizga tegishli o'ziz hulosa qiling",
      "savollarga tanlab javob berasizku shundaymi",
      "nima jimsiz shuncha gapdan keyin ham",
      "Savolingiz oldidan deb qo'yishinhiz shart",
      "Assalomu alaykum sogligingiz yaxshimi men CSS dagi loyihamni yubora olmayapman zip filelim 5mbdan katta boʻlib ketipti git hub repository havolasini oldim mb katta deyapti qanday qilib kichraytirsam boʻladi?",
      "Uyga vazifamni yuklolmayapman",
      "Shu joyini qila olmayabman yordam berib yuboring HTML asoslari modulining oxiridagi topshiriq",
      "Assalomu alaykum, Baxriddinov. Savollingizga tezroq javob olish uchun iltimos xabarda , , , , , kabi kerakli heshteg belgisidan foydalaning.",
      "lotin_kirill telegram botda kichik textlarni kirill ga o'zgartiryapti lekin katta textlarni lotin ligicha qaytaryapti. Bilganlar nimada xato qilganligimni aytib beringlar , iltimos",
      "Assalomu alaykum, . Savollingizga tezroq javob olish uchun iltimos xabarda , , , , , kabi kerakli heshteg belgisidan foydalaning.",
      "Assalomu aleykum yaxshimisiz, yaqin ortada video uchrashuv boladimi fastapi da loiha qolib ketudikan keyin ci cd koramiz deudiz",
      "Asssalomu alaykum kursni bolib tolashga olgandim shuni oldindan toliq to'lov qilsa boladimi",
      "Assalomu alaykum, python asoslari uchun vazifani yuborgan edim muvaffaqiyatsiz bulibdi aynan qayerda xato borligini bilmayapman aytsangiz tug'rilardim, lekin shartda aytilgandik ishlayaptiku kod.",
      "menga sababi aytilmagan qayerda xato borligini aytsangiz yana qaytadan yuborardim, yoki 1-masalada \"return\" emas \"print\" yozganim uchunmi.",
      "Assalomu alekum \"HTMLʼda Job Application (ish arizasi) yasash\" da nmani yasashim kere chunmadim",
      "Assalomu aleykum. Basic ichidagi hamma elementlarni qilish kerakmi,yoki bittasini tanlab faqat o'shanimi",
      "assalomu alekum mamini tugatganimdan keyin nma qilaman ?",
      "Shu mavzuni bajaryotgan edim sayitda yulduzcha iconkasini chiqmayabdi kodni toʻgʻri yozdim qayerda xato borligini topolmayabman",
      "mana kodi linkni ham tekshirdim lekin bo'lmayabdi",
      "blog sahifasida password restart qilayotgan edim emaildan keladigan habarni consoleda olayapman lekin u sahifaga kirsam h1 yoki paragraph teglar chiqayapti lekin yangi parol qoyish uchun forma chiqmayapti .",
      "men loyohani yukladim tekshirib bering iltimos",
      "men loyohani yukladim tekshirib bering iltimos",
      "Assalomu alekum FULL STACKda Html va Css ni mukammal organish qanchalik muhim yoki uncha muhimmasmi? kop AI lar HTML va CSS codlarini profisanalniy qilib yozberyabdiku CSSda kuchli fokus bilan oqimasdan JV va PYTHON boshlanganda toliq fokus berib oqish togri boladimi?",
      "ustoz anashuni yuklab bilmayabman mn anacondadagi spyderda ishlayabman shuni yuklashga 3kundan qiynalyabman yordam bera oalsizmi",
      "qaysi usulni qullamay anashu so’z chiqyati nima qisam buladi kim biladiiii",
      "assalomu alekum iltimos meni vazifamni tekshirib bering.",
      "Assalomu aleykum kimda newsfeed template zip fayli bolsa tashlab yuborsin men topa olmayotgan edim faqat saytdan yuklab olingan zip kk edi",
      "assalomu alekum meni vazifam tekshirilibdi, ln men 2 daqiqa qolganda ko'ryapman qayta topshirish uchun nima qilsam bo'ladi",
      "Assalomu alekim vmin va vmax lar umuman chunarsiz chatgptda ham chunmadim nimani tavsiya berasiz",
      "Assalomu alekum css amaliy loyiha Sahifa dizayini yaratishda taxminan shunaqa boladimi?",
      "Assalomu alaykum. Omborxona tizimi vazifasini uncha tushunmayapman. 1. Soʻrov client soʻrov yuborilganida remainder qiymati kamayishi kerak-ku. Lekin bu yerda ayrilmasin deyilibdi. 2-abzatsda esa \"...keyingi mahsulotlar uchun partiyalar qoldig‘idan foydalaning\" deyilgan. Bu degani baribir ayrilishi kerak degani emasmi? 2. 40 ta ip soʻralyapti, lekin \"warehouse_id\": 3 dagi iplar yetarli (40 ta) boʻlsa ham, \"warehouse_id\": 4 dan yana 260 ta olinyapti.",
      "Mana shu ilova yoʻq ekan windows rus tilida menimcha",
      "if nima edi",
      "Assalomu alaykum playwrightda ishlab koʻrganlar yordam beringlar. Men bitta faylni saytda yuklab olmoqchi edim. Buning uchun saytga kirib filter oʻrnataman > yangi sahifa ochiladi u yerda fayl formatini tanlab yuklab olish tugamsini bisishim bilan turgan sahifam yopilib yangi ssahifa ochiladi, yangi sahifa yuklanishi bu faylni yuklanishi degani, fayl yuklanishi bilan ubsafifa ham avtomatik yopilib birinchi kirgan saytimning oʻzi qolyapti. Shu jarayonni playwrightda bilan qanday qilsam boʻladi",
      "Assalomu alaykum playwrightda ishlab koʻrganlar yordam beringlar. Men bitta faylni saytda yuklab olmoqchi edim. Buning uchun saytga kirib filter oʻrnataman > yangi sahifa ochiladi u yerda fayl formatini tanlab yuklab olish tugamsini bisishim bilan turgan sahifam yopilib yangi ssahifa ochiladi, yangi sahifa yuklanishi bu faylni yuklanishi degani, fayl yuklanishi bilan ubsafifa ham avtomatik yopilib birinchi kirgan saytimning oʻzi qolyapti. Shu jarayonni playwrightda bilan qanday qilsam boʻladi",
      "mana shu savolga qaysi boladi"
    ]
  },
  {
    "cluster_id": 1,
    "question": "Ассалому алайкум html va css ни тугатгандан кейин амалий лойиха берилди буни асосий сахифасини озини киламизми йоки хар бир менюсини килишим керакми",
    "variants": [
      "курсни биринчи HTML боскичини тугатдим. Топшириқни бажаришим керак шу бўйича кимга мурожаат қилсам бўлади.",
      "Ассалому алайкум html va css ни тугатгандан кейин амалий лойиха берилди буни асосий сахифасини озини киламизми йоки хар бир менюсини килишим керакми",
      "Ассалому алайкум html va css ни тугатгандан кейин амалий лойиха берилди буни асосий сахифасини озини киламизми йоки хар бир менюсини килишим керакми"
    ]
  },
  {
    "cluster_id": 2,
    "question": ". Assalomu aleykum psycopg2 install qilishda xatolik beryapti.",
    "variants": [
      ". Assalomu aleykum psycopg2 install qilishda xatolik beryapti.",
      "Assalawma aleykum Ahost ga juklegen saytimnin product photolari korinbey atir. Qanday tuwirlasaq boladi? psycopg2 install bolmadi ornina psycopg2-binary install qildim. Usidan boliwi mumkin ba? Solay bolsa psycopg2 qanday install qilamiz?",
      "psycopg2 ni install qilsam shunaqa xato chiqaryapti",
      "Assolomu alaykum psycopy2ni install qilmoqchi bo'lsam shu xatolikni beryapti qanday yechim topish mumkin."
    ]
  },
  {
    "cluster_id": 3,
    "question": "shared styl ulanmayapti",
    "variants": [
      "shared stilni olamyapti nima xato bo'lishi mumkin?👆",
      "shared styl ulanmayapti"
    ]
  },
  {
    "cluster_id": 4,
    "question": "psql ni qayta o'rnatmasdan, requirementsni o'zidan ham o'zgartirib qo'yilsa bo'ladimi?",
    "variants": [
      "psql ni qayta o'rnatmasdan, requirementsni o'zidan ham o'zgartirib qo'yilsa bo'ladimi?",
      "psql shell menda rus tilida ekan inglzi tiliga o'tkazishni iloji bormi shelni o'zidan turib mahsus commandlar orqali?"
    ]
  },
  {
    "cluster_id": 5,
    "question": "men rasm ko'rsatilgan packageni o'rnatdim lekin hato beryapti yordam berib yuboring",
    "variants": [
      "men rasm ko'rsatilgan packageni o'rnatdim lekin hato beryapti yordam berib yuboring",
      "men rasm ko'rsatilgan packageni o'rnatdim lekin hato beryapti yordam berib yuboring"
    ]
  },
  {
    "cluster_id": 6,
    "question": "drf da view lar yozish uchun bir nechta variantlar bor masalan: Apiview genericView Viewset lar mixinslar va hammasida ham biz koʻzlagan viewimizni yoza olamiz savol qaysi birini qaysi holatda qoʻllash kerakligini qanday bilamiz qaysi birini qayerda qoʻllasak yaxshi boʻladi shu boʻyicha tavsiya bering",
    "variants": [
      "drf da view lar yozish uchun bir nechta variantlar bor masalan: Apiview genericView Viewset lar mixinslar va hammasida ham biz koʻzlagan viewimizni yoza olamiz savol qaysi birini qaysi holatda qoʻllash kerakligini qanday bilamiz qaysi birini qayerda qoʻllasak yaxshi boʻladi shu boʻyicha tavsiya bering",
      "drf da view lar yozish uchun bir nechta variantlar bor masalan: Apiview genericView Viewset lar mixinslar va hammasida ham biz koʻzlagan viewimizni yoza olamiz savol qaysi birini qaysi holatda qoʻllash kerakligini qanday bilamiz qaysi birini qayerda qoʻllasak yaxshi boʻladi shu boʻyicha tavsiya bering"
    ]
  },
  {
    "cluster_id": 7,
    "question": "JavaScript Python ,ва бошка бўлимларнинг дарс файлларини (PDF) каердан олсам булади.",
    "variants": [
      "JavaScript Python ,ва бошка бўлимларнинг дарс файлларини (PDF) каердан олсам булади.",
      "JavaScript Python ,ва бошка бўлимларнинг дарс файлларини (PDF) каердан олсам булади."
    ]
  },
  {
    "cluster_id": 8,
    "question": "bitta muammo bor ustoz darsda shu kodni yozgan men ham server olgan edim endi men qanday kod yozishim kerak bo'ladi collect static qilsam rasmlar chiqmayabdi. static va mediaga shuni o'zini yozishim yetarlimi ozroq tushunmayabman qanday qilishni",
    "variants": [
      "load static ishlamaypati yordam berib yuboringlar",
      "static fayllar ishga tushmayapti , kodni 3marta tekshirib solishtirib chiqdim , ko'rib bera olaszmi",
      "bitta muammo bor ustoz darsda shu kodni yozgan men ham server olgan edim endi men qanday kod yozishim kerak bo'ladi collect static qilsam rasmlar chiqmayabdi. static va mediaga shuni o'zini yozishim yetarlimi ozroq tushunmayabman qanday qilishni",
      "hamma static fayllarni togri uladim lekin serverda mukammal chiqmayapti"
    ]
  },
  {
    "cluster_id": 9,
    "question": "Bootstrapdagi POPOVER ni qanday ishlatsak boladi videodagi <SCRIPT> da yozilgan kode kerak videodagini yozsam ishlamayapti",
    "variants": [
      "Bootstrapdagi POPOVER ni qanday ishlatsak boladi videodagi <SCRIPT> da yozilgan kode kerak videodagini yozsam ishlamayapti",
      "Bootstrapdagi POPOVER ni qanday ishlatsak boladi videodagi <SCRIPT> da yozilgan kode kerak videodagini yozsam ishlamayapti"
    ]
  },
  {
    "cluster_id": 10,
    "question": "Salom menda bir savol darslikda berilayotgan kodlarni hammasini yodlab olish shartmi",
    "variants": [
      "o'rnatilgan hammasi",
      "Salom menda bir savol darslikda berilayotgan kodlarni hammasini yodlab olish shartmi"
    ]
  },
  {
    "cluster_id": 11,
    "question": "men css darslarida (max-width:767px) qilsam ishlayapti video darsdagidek qilib only screen and (max-width:767px) deb koʻrsatsam ishlamayapti",
    "variants": [
      "men css darslarida (max-width:767px) qilsam ishlayapti video darsdagidek qilib only screen and (max-width:767px) deb koʻrsatsam ishlamayapti",
      "men css darslarida (max-width:767px) qilsam ishlayapti video darsdagidek qilib only screen and (max-width:767px) deb koʻrsatsam ishlamayapti"
    ]
  },
  {
    "cluster_id": 12,
    "question": "Assalomu alaykum DRF darslarini ohiridagi MOCK Task ishlash da kompyuterim Postgresql ni Support qilmaydigan edi chuning uchun Default db da ishlab shiqtim bu inobatga olinadimi. Lekim Postgresql sozlamalarin bilaman...",
    "variants": [
      "Assalomu alaykum DRF darslarini ohiridagi MOCK Task ishlash da kompyuterim Postgresql ni Support qilmaydigan edi chuning uchun Default db da ishlab shiqtim bu inobatga olinadimi. Lekim Postgresql sozlamalarin bilaman...",
      "Kompyuterda vaqtinchalik botni test qilib korgani data base kere bolarkan postgresql soravotti"
    ]
  },
  {
    "cluster_id": 13,
    "question": "Css vazifasiga berilgan loyihani rasmlarini qayerdan olsa boladi",
    "variants": [
      "Assalomu alykum css dagi loyihani rasmlarini qayerdan olsa boladi",
      "savol job aplication qismida style beriladigan qismida otilmagan qismlarni bajarishimiz shartmi style berish qiyin bolyapti",
      "Css vazifasiga berilgan loyihani rasmlarini qayerdan olsa boladi"
    ]
  },
  {
    "cluster_id": 14,
    "question": "€𝚉𝚊𝚏𝚊𝚛𝚓𝚘𝚗 | 𝚃𝚞𝚛𝚐𝚞𝚗𝚋𝚘𝚢𝚎𝚟, [9/10/2024 3:57 PM] €𝚉𝚊𝚏𝚊𝚛𝚓𝚘𝚗 | 𝚃𝚞𝚛𝚐𝚞𝚗𝚋𝚘𝚢𝚎𝚟, [9/10/2024 3:59 PM] Assalomu Alaykum! Phonenumbers kutubxonasidan foydalanib, barcha davlat raqamlarini ro'yhatdan o'tkazmoqchiman lekin kodimdagi ayrim xatoliklar tufayli yoki boshqa sabablarga ko'ra boshqa davlat raqamlari ro'yhatdan o'tolmayapti ya'ni raise ValidationError dagi xatolikni response qilyapti",
    "variants": [
      "€𝚉𝚊𝚏𝚊𝚛𝚓𝚘𝚗 | 𝚃𝚞𝚛𝚐𝚞𝚗𝚋𝚘𝚢𝚎𝚟, [9/10/2024 3:57 PM] €𝚉𝚊𝚏𝚊𝚛𝚓𝚘𝚗 | 𝚃𝚞𝚛𝚐𝚞𝚗𝚋𝚘𝚢𝚎𝚟, [9/10/2024 3:59 PM] Assalomu Alaykum! Phonenumbers kutubxonasidan foydalanib, barcha davlat raqamlarini ro'yhatdan o'tkazmoqchiman lekin kodimdagi ayrim xatoliklar tufayli yoki boshqa sabablarga ko'ra boshqa davlat raqamlari ro'yhatdan o'tolmayapti ya'ni raise ValidationError dagi xatolikni response qilyapti",
      "€𝚉𝚊𝚏𝚊𝚛𝚓𝚘𝚗 | 𝚃𝚞𝚛𝚐𝚞𝚗𝚋𝚘𝚢𝚎𝚟, [9/10/2024 3:57 PM] €𝚉𝚊𝚏𝚊𝚛𝚓𝚘𝚗 | 𝚃𝚞𝚛𝚐𝚞𝚗𝚋𝚘𝚢𝚎𝚟, [9/10/2024 3:59 PM] Assalomu Alaykum! Phonenumbers kutubxonasidan foydalanib, barcha davlat raqamlarini ro'yhatdan o'tkazmoqchiman lekin kodimdagi ayrim xatoliklar tufayli yoki boshqa sabablarga ko'ra boshqa davlat raqamlari ro'yhatdan o'tolmayapti ya'ni raise ValidationError dagi xatolikni response qilyapti"
    ]
  },
  {
    "cluster_id": 15,
    "question": "responsive qilishda tepasi o'xshadi paski qismi ekran bo'ylab cho'zilmayabdi negadir",
    "variants": [
      "kichraytirgandayam butun ekran bo'ylab cho'zilishini qanday qiladi",
      "responsive qilishda tepasi o'xshadi paski qismi ekran bo'ylab cho'zilmayabdi negadir"
    ]
  },
  {
    "cluster_id": 16,
    "question": "Drf kursida Modelda email_phone_number maydoni yoʻq Shuning uchun User() got unexpected keyword arguments: 'email_phone_number' qaytaryapti",
    "variants": [
      "Assalawma aleykum Mende usinday TypeError korsetip tur qalay tuwirlaymiz? TypeError: User() got unexpected keyword arguments: 'email_phone_number'",
      "Drf kursida Modelda email_phone_number maydoni yoʻq Shuning uchun User() got unexpected keyword arguments: 'email_phone_number' qaytaryapti"
    ]
  },
  {
    "cluster_id": 17,
    "question": "Domain olib uladim hammasi ishlayapti. Endi boshqa muammo bor;) Websocketga soʻrov yuborilsaa 500 qaytyapti, loglarda redisga connection confused beryapti",
    "variants": [
      "Websocket bilan ishlab serverga qoyib ishlaganlar bormi, nginxda websocket ga permission qanday berish kerak 403 qaytaraypati connect qilmoqchi bolsam",
      "Domain olib uladim hammasi ishlayapti. Endi boshqa muammo bor;) Websocketga soʻrov yuborilsaa 500 qaytyapti, loglarda redisga connection confused beryapti"
    ]
  },
  {
    "cluster_id": 18,
    "question": "basemodeldan created time ni olib tashlasam mekmigrations bo'layabdi lekin post name da xatolik berayabdi",
    "variants": [
      "Menda created time xatoligi berayabdi nima qilsam bo'ladi gitdagi loyidan copy paste qilib ham ko'rdim",
      "basemodeldan created time ni olib tashlasam mekmigrations bo'layabdi lekin post name da xatolik berayabdi"
    ]
  },
  {
    "cluster_id": 19,
    "question": "Assalomu alaykum. CSS boʻlimidagi shu portfolio rasmlar joylashtirishda muammo bo'lyapti . Rasmlarni videodarsda display- relative va absolute bilan foydalanib joylashtirgandilar ustoz . Men ham shunday joylashtirdim . Lekin buni kamchiligi responsive emas. Kompyuterlar uchun rasm balandligini topib, absolute uchun top bergandim , yaxshi chiqdi lekin planshetlar uchun rasm kengaytirilgan da yoki kichraytirilsa, 3-rasm pastga yoki tepaga chiqib ketyapti chunki 2- rasm yani soatning balandligi har xil boʻlib oʻzgaryapti planshet razmerida .",
    "variants": [
      "Assalomu alaykum. CSS boʻlimidagi shu portfolio rasmlar joylashtirishda muammo bo'lyapti . Rasmlarni videodarsda display- relative va absolute bilan foydalanib joylashtirgandilar ustoz . Men ham shunday joylashtirdim . Lekin buni kamchiligi responsive emas. Kompyuterlar uchun rasm balandligini topib, absolute uchun top bergandim , yaxshi chiqdi lekin planshetlar uchun rasm kengaytirilgan da yoki kichraytirilsa, 3-rasm pastga yoki tepaga chiqib ketyapti chunki 2- rasm yani soatning balandligi har xil boʻlib oʻzgaryapti planshet razmerida .",
      "Assalomu alaykum. CSS boʻlimidagi shu portfolio rasmlar joylashtirishda muammo bo'lyapti . Rasmlarni videodarsda display- relative va absolute bilan foydalanib joylashtirgandilar ustoz . Men ham shunday joylashtirdim . Lekin buni kamchiligi responsive emas. Kompyuterlar uchun rasm balandligini topib, absolute uchun top bergandim , yaxshi chiqdi lekin planshetlar uchun rasm kengaytirilgan da yoki kichraytirilsa, 3-rasm pastga yoki tepaga chiqib ketyapti chunki 2- rasm yani soatning balandligi har xil boʻlib oʻzgaryapti planshet razmerida ."
    ]
  },
  {
    "cluster_id": 20,
    "question": "15K 12K lar yonma yon turishi uchun nimalarni uzgartirish kerak??",
    "variants": [
      "15K 12K lar yonma yon turishi uchun nimalarni uzgartirish kerak??",
      "15K 12K lar yonma yon turishi uchun nimalarni uzgartirish kerak??"
    ]
  }
]